[
 {
  "title": "The Effective Engineer: How to Leverage Your Efforts in Software Engineering to Make a Disproportionate and Meaningful Impact ",
  "author": "Edmond Lau",
  "highlights": [
   {
    "id": "c9d15e2b42a36d5534790485b7d832a6af2a6310",
    "book": {
     "title": "The Effective Engineer: How to Leverage Your Efforts in Software Engineering to Make a Disproportionate and Meaningful Impact ",
     "author": "Edmond Lau",
     "highlights": [],
     "id": "bd4ab615a85c19388442304fb5a47797282a00cb"
    },
    "text": "as most companies grow, they slow down too much because they’re more afraid of making mistakes than they are of losing opportunities by moving too slowly … [I]f you never break anything, you’re probably not moving fast enough.”",
    "page": null,
    "language": "en"
   }
  ],
  "id": "bd4ab615a85c19388442304fb5a47797282a00cb"
 },
 {
  "title": "Clean Architecture: A Craftsman's Guide to Software Structure and Design, 1/e ",
  "author": "Robert C. Martin",
  "highlights": [
   {
    "id": "3636c271d09344462fa9bd22d38e0e78a87d8365",
    "book": {
     "title": "Clean Architecture: A Craftsman's Guide to Software Structure and Design, 1/e ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "1e5db0126e5bc682774c25387d34357fb9c4a608"
    },
    "text": "Programmers are hired to make machines behave in a way that makes or saves money for the stakeholders.",
    "page": null,
    "language": "en"
   }
  ],
  "id": "1e5db0126e5bc682774c25387d34357fb9c4a608"
 },
 {
  "title": "Sapiens. De animales a dioses (Spanish Edition) ",
  "author": "Harari, Yuval Noah",
  "highlights": [
   {
    "id": "dde16e38806d537cae8e5c4914b136fcefbe51b8",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "La historia es algo que ha hecho muy poca gente mientras que todos los demás araban los campos y acarreaban barreños de agua.",
    "page": null,
    "language": "es"
   },
   {
    "id": "85e99ad6884c551a403850b8d6064b159c962f1f",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "La boca, por ejemplo, apareció porque los primitivos organismos pluricelulares necesitaban una manera de incorporar nutrientes a su cuerpo. Todavía usamos la boca para este propósito, pero también la empleamos para besar, hablar y, si somos Rambo, para extraer la anilla de las granadas de mano.",
    "page": null,
    "language": "es"
   },
   {
    "id": "91bc571f42014f39f9e0968cfcb9d4efc546ffa9",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "En la actualidad, muchos norteamericanos sostienen que su gobierno tiene el imperativo moral de llevar a los países del Tercer Mundo los beneficios de la democracia y de los derechos humanos, aunque estos sean repartidos mediante misiles de crucero y F-16.",
    "page": null,
    "language": "es"
   },
   {
    "id": "9f5b341dff0761feb68f156295425a56e0e4fdb4",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Ningún concepto, idea o teoría son sagrados ni se hallan libres de ser puestos en entredicho.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "2750afc5e9736af45ce7e9410d2329dab6da1df8",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Un día, mientras efectuaban actividades de adiestramiento, los astronautas se encontraron con un anciano americano nativo. El hombre les preguntó qué hacían allí. Le contestaron que formaban parte de una expedición de investigación que muy pronto viajaría para explorar la Luna. Cuando el anciano oyó esto, quedó en silencio por unos momentos, y después les pidió a los astronautas si le podrían hacer un favor. —¿Qué quiere usted? —le preguntaron. —Bueno —dijo el anciano—, la gente de mi tribu cree que en la Luna viven espíritus sagrados. Me preguntaba si ustedes les podrían transmitir un mensaje importante para ellos de parte de mi pueblo. —¿Cuál es el mensaje? —preguntaron los astronautas. El hombre pronunció algo en su lenguaje tribal, y después les pidió a los astronautas que lo repitieran una y otra vez hasta que lo memorizaron correctamente. —¿Qué significa? —preguntaron los astronautas. —¡Oh!, no puedo decírselo. Es un secreto que solo nuestra tribu y los espíritus de la Luna pueden conocer. Cuando volvieron a su base, los astronautas buscaron y buscaron hasta que encontraron a alguien que podía hablar el lenguaje tribal, y le pidieron que tradujera el mensaje secreto. Al repetir lo que habían aprendido de memoria, el traductor empezó a reírse ruidosamente. Tras calmarse, los astronautas le preguntaron qué quería decir. El hombre les explicó que la frase que habían aprendido de memoria con tanto cuidado decía: «No os creáis ni una palabra de lo que esta gente os diga. Han venido para robaros vuestras tierras».",
    "page": null,
    "language": "es"
   },
   {
    "id": "8a6f2051827ba3a149f5aa98c54e3ef5ff800fec",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "La economía es un asunto notoriamente complicado. Para hacer las cosas más fáciles, imaginemos un ejemplo sencillo. Samuel Avaro, un astuto financiero, funda un banco en El Dorado, California. A. A. Marrullero, un constructor con futuro en El Dorado, termina su primer trabajo de envergadura, y recibe el pago en metálico por la cantidad de 1 millón de dólares. Deposita esta suma en el banco del señor Avaro. Ahora el banco dispone de 1 millón de dólares en capital. Mientras tanto, Juana Rosquilla, una cocinera experimentada pero pobre, piensa que existe una oportunidad de negocio: en su parte de la ciudad no hay una panadería y pastelería realmente buena. Pero no tiene suficiente dinero propio para comprar una instalación completa con hornos industriales, fregaderos, cuchillos y cacerolas. Se dirige al banco, presenta su plan de negocio a Avaro y lo persuade de que se trata de una inversión que vale la pena. Este le concede un préstamo de 1 millón de dólares, acreditando dicha suma en la cuenta bancaria de Rosquilla. Juana contrata ahora a Marrullero, el constructor, para que construya y amueble su pastelería. Su precio es de 1 millón de dólares. Cuando ella le paga, con un cheque contra su cuenta, Marrullero lo deposita en su cuenta en el banco de Avaro. De modo que ¿cuánto dinero tiene Marrullero en su cuenta bancaria? Correcto, 2 millones de dólares. ¿Cuánto dinero en efectivo tiene en su caja fuerte del banco? Correcto, 1 millón de dólares. La cosa no termina aquí. Como suelen hacer los constructores, a los dos meses de empezar las obras, Marrullero informa a Rosquilla de que, debido a problemas y gastos imprevistos, la factura por la construcción de la panadería y pastelería subirá en realidad a 2 millones de dólares. La señora Rosquilla no está en absoluto contenta, pero no puede detener las obras a medio terminar. De manera que efectúa otra visita al banco, convence al señor Avaro para que le conceda un préstamo adicional, y el banquero deposita otro millón de dólares en la cuenta de la cocinera. Esta transfiere el dinero a la cuenta del constructor. ¿Cuánto dinero tiene ahora Marrullero en su cuenta bancaria? Ha conseguido 3 millones de dólares. Pero ¿cuánto dinero hay realmente depositado en el banco? Sigue habiendo solo 1 millón de dólares. En realidad, el mismo millón de dólares que ha estado todo el tiempo en el banco. Las leyes bancarias estadounidenses actuales permiten que el banco repita este ejercicio otras siete veces. El constructor tendría al final 10 millones de dólares en su cuenta, aunque el banco sigue sin tener más que 1 millón de dólares en su cámara acorazada. A los bancos se les permite prestar diez dólares por cada dólar que posean realmente, lo que significa que el 90 por ciento de todo el dinero de nuestras cuentas bancarias no está cubierto por monedas y billetes reales.",
    "page": null,
    "language": "es"
   },
   {
    "id": "8d44fdc0d3f35edd2b76cd15547725efef693e25",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Durante los últimos años, bancos y gobiernos han estado imprimiendo dinero de manera frenética. Todo el mundo está aterrorizado ante la posibilidad de que la crisis económica actual pueda detener el crecimiento de la economía. De modo que están creando de la nada billones de dólares, euros y yenes, inyectando crédito barato en el sistema, y esperando que científicos, técnicos e ingenieros consigan dar con algo realmente grande antes de que estalle la burbuja. Todo depende de la gente que hay en los laboratorios. Nuevos descubrimientos en campos como la biotecnología y la inteligencia artificial podrían crear industrias totalmente nuevas, cuyos beneficios podrían respaldar los billones de dinero de mentirijillas que bancos y gobiernos han creado desde 2008. Si los laboratorios no cumplen dichas expectativas antes de que la burbuja estalle, nos encaminamos a tiempos realmente duros.",
    "page": null,
    "language": "es"
   },
   {
    "id": "4d8e3af6000f063877c16ea9efe9a7c7bacff583",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Los imperios construidos por banqueros y comerciantes vestidos con levitas y sombreros de copa vencieron a los imperios construidos por reyes y nobles vestidos de oro y relucientes armaduras.",
    "page": null,
    "language": "es"
   },
   {
    "id": "1e082e9b8f785572ce86779f0fe8c85eaabc5621",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "El ejemplo más notorio de cómo los gobiernos cumplieron el mandato del gran dinero fue la primera guerra del opio, que se libró entre Gran Bretaña y China (1840-1842). En la primera mitad del siglo XIX, la Compañía Británica de las Indias Orientales y diversos hombres de negocios ingleses amasaron fortunas mediante la exportación de drogas, principalmente opio, a China. Millones de chinos se convirtieron en adictos, lo que debilitó al país tanto económica como socialmente. A finales de la década de 1830, el gobierno chino promulgó una prohibición del tráfico de drogas, pero los comerciantes ingleses de las drogas simplemente ignoraron la ley. Las autoridades chinas empezaron a confiscar y a destruir los cargamentos de drogas. Los monopolios de las drogas tenían estrechas conexiones en Westminster y Downing Street (de hecho, muchos miembros del Parlamento y ministros del gabinete poseían acciones de las compañías de drogas), de modo que presionaron al gobierno para que actuara. En 1840, Gran Bretaña declaró puntualmente la guerra a China en nombre del «libre comercio». Fue un triunfo fácil. Los chinos, demasiado confiados, no eran rival para las nuevas y poderosas armas de Gran Bretaña: buques de vapor, artillería pesada, cohetes y rifles de repetición. Según el tratado de paz subsiguiente, China aceptaba no limitar las actividades de los comerciantes de drogas ingleses y compensarlos por los daños infligidos por la policía china. Además, los ingleses reclamaron y obtuvieron el control de Hong Kong, que a continuación usaron como base segura para el tráfico de drogas (Hong Kong siguió en manos inglesas hasta 1997). A finales del siglo XIX, unos 40 millones de chinos, la décima parte de la población del país, eran adictos al opio.",
    "page": null,
    "language": "es"
   },
   {
    "id": "1acbe7cb63d80e00f27e417dba5105ea3d015a9b",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "En 1821, los griegos se rebelaron contra el Imperio otomano. El levantamiento despertó una gran simpatía en los círculos liberales y románticos de Gran Bretaña; lord Byron, el poeta, fue incluso a Grecia para luchar junto a los insurgentes. Sin embargo, los financieros de Londres vieron asimismo una oportunidad. Propusieron a los jefes rebeldes emitir bonos de la rebelión griega, negociables, en el mercado de valores de Londres. Los griegos tenían que prometer devolver el importe de los bonos, más los intereses, siempre y cuando obtuvieran la independencia. Los inversores privados compraron bonos para obtener un beneficio, o porque simpatizaban con la causa griega, o por ambas razones. El valor de los bonos de la rebelión griega subía y bajaba en la Bolsa de Londres según los éxitos y fracasos militares en los campos de batalla de la Hélade. Gradualmente, los turcos consiguieron ventaja. Con una derrota inminente de los rebeldes, los accionistas se enfrentaban a la posibilidad de perderlo todo. El interés de los accionistas era el interés nacional, de manera que los ingleses organizaron una flota internacional que, en 1827, hundió a la flotilla otomana en la batalla de Navarino. Después de siglos de dominación, Grecia se hallaba libre al fin. Pero la libertad vino acompañada de una deuda enorme que el nuevo país no tenía manera de devolver. La economía griega quedó hipotecada a los inversores ingleses durante décadas.",
    "page": null,
    "language": "es"
   },
   {
    "id": "96f70298abe8db1ae5031038327355581d1c6c5e",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "En la Edad Media, el azúcar era un lujo raro en Europa. Se importaba de Oriente Próximo a precios prohibitivos y se usaba frugalmente como ingrediente secreto en golosinas y medicamentos de aceite de serpiente. Una vez que se hubieron establecido grandes plantaciones de caña de azúcar en América, a Europa empezaron a llegar cantidades crecientes de azúcar. El precio del azúcar bajó y Europa desarrolló un insaciable gusto por los dulces. Los emprendedores satisficieron dicha necesidad al producir cantidades enormes de dulces: pasteles, galletas, chocolate, caramelos y bebidas azucaradas como cacao, café y té. La ingesta anual de azúcar del ciudadano inglés medio pasó de casi cero a principios del siglo XVII a unos ocho kilogramos a principios del XIX. Sin embargo, cultivar la caña y extraer su azúcar era una empresa que requería trabajo intensivo. Pocas personas querían trabajar largas horas en campos de caña infestados de malaria bajo un sol tropical. Los trabajadores contratados habrían producido un bien demasiado caro para el consumo de masas. Sensibles a las fuerzas del mercado, y codiciosos de obtener beneficios y crecimiento económico, los propietarios europeos de las plantaciones cambiaron a los esclavos. Desde el siglo XVI al XIX, unos 10 millones de esclavos africanos fueron importados a América. Alrededor del 70 por ciento de ellos trabajaron en las plantaciones de azúcar. Las condiciones de trabajo eran abominables. La mayoría de los esclavos vivían una vida corta y miserable, y otros millones más murieron durante las guerras emprendidas para capturar esclavos o durante el largo viaje desde el interior de África a las costas de América. Y todo esto para que los europeos pudieran gozar de su té dulce y sus golosinas, y para que los magnates del azúcar pudieran obtener enormes ganancias.",
    "page": null,
    "language": "es"
   },
   {
    "id": "16fb00f1dd4d8192e6f3f0041db5c2d8208a8100",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Este es el pequeño inconveniente del capitalismo de libre mercado: no puede asegurar que los beneficios se obtengan de manera justa, o que se distribuyan de manera justa. Por el contrario, las ansias de aumentar los beneficios y la producción impiden ver a la gente cualquier cosa que se interponga en el camino. Cuando el crecimiento se convierte en un bien supremo, no limitado por ninguna otra consideración ética, puede conducir fácilmente a la catástrofe.",
    "page": null,
    "language": "es"
   },
   {
    "id": "f4fa2dbc77b015028454b0853fa60b2d0bed38ff",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "En 1876, el rey Leopoldo II de Bélgica fundó una organización humanitaria no gubernamental cuyo objetivo declarado era explorar el África central y combatir el tráfico de esclavos a lo largo del río Congo. También tenía el encargo de mejorar las condiciones para los habitantes de la región mediante la construcción de carreteras, escuelas y hospitales. En 1885, las potencias europeas acordaron conceder a esta organización el control de 2,3 millones de kilómetros cuadrados en la cuenca del Congo. Dicho territorio, de 75 veces el tamaño de Bélgica, se conoció a partir de entonces como Estado Libre del Congo. Nadie pidió la opinión de los 20-30 millones de habitantes del territorio. En cuestión de poco tiempo, la organización humanitaria se convirtió en una empresa de negocios cuyo objetivo real era el crecimiento y los beneficios. Las escuelas y los hospitales se olvidaron, y en cambio la cuenca del Congo se llenó de minas y plantaciones, dirigidas por funcionarios en su mayoría belgas que explotaban de manera despiadada a la población local.",
    "page": null,
    "language": "es"
   },
   {
    "id": "63afdefcf09ffaf31c79dcc2c30e336c4848c92c",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Los químicos no descubrieron el aluminio hasta la década de 1820, pero separar el metal de su mena era extraordinariamente difícil y costoso. Durante",
    "page": null,
    "language": "es"
   },
   {
    "id": "7295457020aa3648173ab03ffd2884072c23021e",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "En la época en que Homo sapiens era elevado al nivel divino por las religiones humanistas, los animales de granja dejaron de verse como criaturas vivas que podían sentir dolor y angustia, y en cambio empezaron a ser tratados como máquinas. En la actualidad, estos animales son producidos en masa en instalaciones que parecen fábricas, y su cuerpo se modela según las necesidades industriales. Pasan toda su vida como ruedas de una línea de producción gigantesca, y la duración y calidad de su existencia están determinadas por los beneficios y pérdidas de las empresas. Incluso cuando la industria se ocupa de mantenerlos vivos, razonablemente saludables y bien alimentados, no tiene ningún interés intrínseco en las necesidades sociales y psicológicas de los animales, excepto cuando estas tienen un impacto directo en la producción (véase la figura 25).",
    "page": null,
    "language": "es"
   },
   {
    "id": "02081ed7bbdf987969ccdff0ef8bcebf98f9c943",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Muchas vacas lecheras viven casi todos los años que les son permitidos dentro de un pequeño recinto; allí están de pie, se sientan y duermen sobre sus propios orines y excrementos. Reciben su ración de comida, hormonas y medicamentos de un conjunto de máquinas, y son ordeñadas cada pocas horas por otro conjunto de máquinas. La vaca promedio es tratada como poco más que una boca que ingiere materias primas y una ubre que produce una mercancía.",
    "page": null,
    "language": "es"
   },
   {
    "id": "d296782f90e293e3c213ee95d3ace3ff301df200",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Irónicamente, las mismas disciplinas científicas que diseñan nuestras máquinas de ordeñar y de recoger huevos han demostrado últimamente, y más allá de toda duda razonable, que los mamíferos y las aves poseen una constitución sensorial y emocional compleja. No solo sienten dolor físico, sino que pueden padecer malestar emocional.",
    "page": null,
    "language": "es"
   },
   {
    "id": "eaaec1c558062d7ef0b1b415a9b980750ef4638f",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Junto con la mecanización del cultivo de plantas, la zootecnia o ganadería industrial es la base para todo el orden socioeconómico moderno. Antes de la industrialización de la agricultura, la mayor parte del alimento producido en campos y granjas se «malgastaba» al alimentar a campesinos y animales de granja. Solo se disponía de un pequeño porcentaje para alimentar a artesanos, maestros, sacerdotes y burócratas. En consecuencia, en casi todas las sociedades los campesinos suponían más del 90 por ciento de la población. Después de la industrialización de la agricultura, un número decreciente de agricultores era suficiente para alimentar a un número creciente de dependientes de comercio y obreros de fábricas. Hoy en día, en Estados Unidos solo el 2 por ciento de la población vive de la agricultura,[9] pero este 2 por ciento produce lo suficiente no solo para alimentar a toda la población de Estados Unidos, sino también para exportar los excedentes al resto del mundo. Sin la industrialización de la agricultura, la revolución industrial urbana no habría podido tener lugar: no habría habido manos y cerebros suficientes para llenar fábricas y oficinas.",
    "page": null,
    "language": "es"
   },
   {
    "id": "475eeebb8110f3638258de027d48451bb00c8e7a",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "La tragedia de la ganadería industrial es que se cuida mucho de las necesidades objetivas de los animales al tiempo que se olvida de sus necesidades subjetivas.",
    "page": null,
    "language": "es"
   },
   {
    "id": "97b5ca5a6f3a8ede8806b367b7c0f0fa21383424",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Cada año la población de Estados Unidos gasta más dinero en dietas que la cantidad que se necesitaría para dar de comer a toda la gente hambrienta en el resto del mundo.",
    "page": null,
    "language": "es"
   },
   {
    "id": "3fd27c285cc504b9d5398f5e06ff6fd358dd07cd",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "La obesidad es una doble victoria para el consumismo. En lugar de comer poco, lo que conduce a la contracción económica, la gente come demasiado y después compra productos dietéticos, con lo que contribuye doblemente al crecimiento económico.",
    "page": null,
    "language": "es"
   },
   {
    "id": "a090ca2de1c31020781601c3f80f70c4c842abfe",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "La historia de la ética es un triste relato de ideales maravillosos que nadie cumple. La mayoría de los cristianos no imitan a Jesucristo, la mayoría de los budistas no siguen las enseñanzas de Buda",
    "page": null,
    "language": "es"
   },
   {
    "id": "ec18a6b92efc19db258b754f954ceb59b88f442a",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "la mayoría de la gente vive hoy siendo capaz de cumplir con éxito el ideal capitalista-consumista. La nueva ética promete el paraíso a condición de que los ricos sigan siendo avariciosos y pasen su tiempo haciendo más dinero, y que las masas den rienda suelta a sus anhelos y pasiones y compren cada vez más. Esta es la primera religión en la historia cuyos seguidores hacen realmente lo que se les pide que hagan. ¿Y cómo sabemos que realmente obtendremos el paraíso a cambio? Porque lo hemos visto en la televisión.",
    "page": null,
    "language": "es"
   },
   {
    "id": "57d1532ec302bf693ceb360ea641f2d43bb5918a",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Nuestro planeta, antaño verde y azul, se está convirtiendo en un centro comercial de hormigón y plástico.",
    "page": null,
    "language": "es"
   },
   {
    "id": "62b0d48ab406030307770ce39d6ad4b3e08125ba",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Anteriormente, el novio y la novia se encontraban en el salón familiar, y el dinero pasaba de las manos de un padre a las del otro. En la actualidad, el cortejo se hace en bares y cafés, y el dinero pasa de las manos de los amantes a las de los camareros. Y todavía se transfiere más dinero a las cuentas bancarias de los diseñadores de modas, dueños de gimnasios, dietistas, cosmetólogos y cirujanos plásticos, que nos ayudan a llegar al café con un aspecto lo más parecido posible al ideal de belleza del mercado.",
    "page": null,
    "language": "es"
   },
   {
    "id": "a98c57c497f49676cf99c26165ffc1370b4f93bd",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "hoy en día es el mercado el que ajusta nuestras preferencias románticas y sexuales, y después echa una mano para proporcionarlas a un precio elevado. Anteriormente, el novio y la novia se encontraban en el salón familiar, y el dinero pasaba de las manos de un padre a las del otro. En la actualidad, el cortejo se hace en bares y cafés, y el dinero pasa de las manos de los amantes a las de los camareros. Y todavía se transfiere más dinero a las cuentas bancarias de los diseñadores de modas, dueños de gimnasios, dietistas, cosmetólogos y cirujanos plásticos, que nos ayudan a llegar al café con un aspecto lo más parecido posible al ideal de belleza del mercado.",
    "page": null,
    "language": "es"
   },
   {
    "id": "08f94b318786406887a588cb293f31b4d19295ab",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "hoy en día la mayoría de personas pasan mucho más tiempo en el supermercado que en el campo de batalla, y en el supermercado la tribu de consumidores suele ser más poderosa que la nación.",
    "page": null,
    "language": "es"
   },
   {
    "id": "dce6d52f46b7370cb3b9207dba360ac55d5cf109",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "Cuando se juzga la modernidad, es demasiado tentador adoptar el punto de vista de un ciudadano occidental de clase media del siglo XXI. No debemos olvidar los puntos de vista de un minero del carbón galés, de un adicto al opio chino o de un aborigen australiano, todos del siglo XIX. Truganini no es menos importante que Homer Simpson.",
    "page": null,
    "language": "es"
   },
   {
    "id": "79670d9b0ec7ec95101b825da4192f77e86bb9c7",
    "book": {
     "title": "Sapiens. De animales a dioses (Spanish Edition) ",
     "author": "Harari, Yuval Noah",
     "highlights": [],
     "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
    },
    "text": "podemos felicitarnos por los logros sin precedentes de los sapiens modernos únicamente si ignoramos por completo la suerte de todos los demás animales. Gran parte de la riqueza material de la que nos jactamos que nos aísla de la enfermedad y de la hambruna se ha acumulado a expensas de monos de laboratorio, vacas lecheras y pollos en cintas transportadoras.",
    "page": null,
    "language": "es"
   }
  ],
  "id": "15ead5da7b6074ce264884e473f3d66e892bd92b"
 },
 {
  "title": "maintaining-open-source-projects",
  "highlights": [
   {
    "id": "d4b58a70e2134f071a8ab74bd4245e10a56eb260",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "Issue tracker gardening A common problem that results in clutter in the issue tracker is irreproducibility. Users may be trying to show a legit issue with your project, but without enough information to reproduce it, which makes it hard to decide if it is indeed a problem with your project. In this case, ask them to provide more information. You might link toyourbugreportneedsmore.info for a curated, external explanation around reproducibility.",
    "page": null,
    "language": "en"
   },
   {
    "id": "932efca33d54e75a06d0123622f8816b2128431a",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "A common problem that results in clutter in the issue tracker is irreproducibility. Users may be trying to show a legit issue with your project, but without enough information to reproduce it, which makes it hard to decide if it is indeed a problem with your project. In this case, ask them to provide more information. You might link toyourbugreportneedsmore.info for a curated, external explanation around reproducibility.",
    "page": null,
    "language": "en"
   },
   {
    "id": "ef1596eaef47f96b2e0985b4b10462d76400e711",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "To an issue with an unclear description another sometimes helpful route to take is to ask the requester to put together some quick code to further iterate on their issue (a spike). If the requester implements even part of the needed feature you can now have a more valuable discussion over a possible implementation,",
    "page": null,
    "language": "en"
   },
   {
    "id": "b31829582b3c806ef341da5b0ed56dc336043c86",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "The bike shed effect(also called “Parkinson’s law of triviality”) states that groups give disproportionate weight to trivial issues. For example, a committee whose job is to approve plans for a nuclear power plant spends the majority of its time on relatively unimportant but easy-to-grasp issues, such as what materials to use for the staff bike shed, while neglecting the less trivial proposed design of the nuclear power plant itself, which is far more important but also far more difficult and involved to criticize constructively. When you see more activity than usual in a discussion over a superficial matter (according to a threshold you define), take one decision (even if arbitrary) and call it resolved. You will save everybody’s time.",
    "page": null,
    "language": "en"
   },
   {
    "id": "dca19e6caf966af842de5521f590fd112f18e0d4",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "Fairness bias describes our tendency to seek balance. If a supplier keeps an open line of communication with an unhappy customer about a faulty product, the customer will respond more favorably regardless of the outcome. The need to be heard takes precedence over the need for the product working correctly. Fairness bias can be applied to code reviews. Framing an idea as a question instead of as an assertion makes the contributor feel heard and valued. If we are the authors of the code being reviewed, we can harness this effect before the conversation is even started, by explaining the rationale behind our work beforehand.",
    "page": null,
    "language": "en"
   },
   {
    "id": "03e6468ba57f92c19cc1816b938284fc6cbd6440",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "Loss aversion describes people’s tendency to strongly prefer avoiding losses to acquiring gains. More concretely, giving you 5 dollars won’t make you extra happy but if $5 are taken from you, you will get upset. Loss aversion relates with saying “no” to a patch. As a reviewer, giving a clear explanation of the reasons for your rejection helps avoiding a longer discussion on whether the patch should or should not be merged, helping authors see more objectively the value of their contributions. As a contributor, remember that if you were the reviewer or another external party, you would probably be a bit more skeptical than you currently are about the value of your patch.",
    "page": null,
    "language": "en"
   },
   {
    "id": "848c3d382e7f71f367a6828a75280f76234a95eb",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "the positive message you wrote may be assumed to be neutral, and what seemed indifferent to you can be read as hostile. You can avoid this by using positive language instead of neutral. Written discussions have less bandwidth and need to include more context than conversations over the phone or in person.",
    "page": null,
    "language": "en"
   },
   {
    "id": "89af85c74fe4d718012888b1245d67359c58a918",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "treat all your contributors as if they are the most valuable resource. They will respond by becoming your most valuable resource,",
    "page": null,
    "language": "en"
   },
   {
    "id": "9c87726c5c5c8cddded01e80859c4328525e800f",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "while giving feedback it’s good to: • Start with an appreciation of the work or comment. • Phrase ideas as questions when you are not sure that your feedback shows a clear step forward. • Be explicit. Online discussions have less bandwidth than in person and need more context. • Try to respond to every question and comment. • If you disagree strongly, consider giving it a moment before responding. • Don’t assume the audience shares your experience or context. Avoid words like “basically”, “simply”, “clearly”, etc. • Review is of the code, not people. Keep this in mind as a contributor too. Remember: every person knows something you don’t yet know.",
    "page": null,
    "language": "en"
   },
   {
    "id": "16c3518f5d7ed9d61471ecd4577b7ad210178d52",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "In open source nobody owes anything to anyone. If anything, users owe maintainers gratitude for publishing something that was and is useful to them.",
    "page": null,
    "language": "en"
   },
   {
    "id": "2f69223f1c292c26ff3f2b48a1c96fe5c01d816d",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "Keep commits cohesive. • Keep commits as small as possible.",
    "page": null,
    "language": "en"
   },
   {
    "id": "076b683023addce091ae1985493e69c749d5a251",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "if a patch fixes a bug and optimizes the performance of a feature, split it into two separate commits. The implementation of a feature and the corresponding tests belong in the same commit, which should not be split. A small and cohesive commit is easier to review and grasp. Git’s annotateandblame commands will be more clear about the origin and reason behind each line of the entire source code. If you find the need to revert the changeset, it is possible to revertthat single commit in an instant, and the project will exist as if that change wouldn’t have existed in the first place. The same applies if you have to backport (in git terms,cherry-pick) a fix to previous releases. Always keep commits as small and cohesive as possible and ask your contributors to do the same, and the project will be easier to maintain.",
    "page": null,
    "language": "en"
   },
   {
    "id": "c357e684a4f9ca23f3dd94ecafa5c523c50719a8",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "A good commit message answers three questions: • Why is this change necessary? • How does it address the issue? • What effects does the patch have? Note the absence of a “what is” type of question. We have the git log for that already;",
    "page": null,
    "language": "en"
   },
   {
    "id": "fc2f353b5757486498a5d3f748639734f83aec6d",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "Some people see value in keeping the evolution of the code unchanged, commit after commit, having the whole messy (but complete) changeset. Assuming each commit includes an explanation of the rationale behind of it, then history is complete, but that doesn’t mean clear. For a programmer at work, it’s more useful to understand what the code does and why, than a given contributor’s development and learning process. If the author takes the time to send a curated history rather than the raw version, it’s easier for everyone in the team to understand this change.",
    "page": null,
    "language": "en"
   },
   {
    "id": "8fb4c3bf2498e5c963aa5a7936ff44a32dd9c88d",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "It is better to squash commits together right before merging and not earlier. That way, discussion and follow-up commits addressing the feedback stay synchronized, anyone can see how the feature came up to be across the different revisions, and the reviewer always knows what was addressed and what not. Be nice to people, floss every day, and keep your git history clean.",
    "page": null,
    "language": "en"
   },
   {
    "id": "ed5cd4bb7c980d3e00719d5a76a3b2fdb455b627",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "Wikipedia defines legacy code as source code inherited from someone else and source code inherited from an older version of the software. This means any code that lands into master becomes legacy code.",
    "page": null,
    "language": "en"
   },
   {
    "id": "e757b173cfab99bfd8edd16328b1da6e598991c6",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "Code is a liability and solving problems with as little code as possible is almost always a good decision.",
    "page": null,
    "language": "en"
   },
   {
    "id": "38ea65021ba6519f22a16a5b8ee786d886389acc",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "To make sure merging a given patch is a good idea, you can ask the following questions: • Will you or your team want to maintain it? • Will the author be reachable for support, answer questions that the community will have around that feature, or fix related bugs? • Will you like maintaining that addition? • Do you see it bringing in more value than cost? Say “no” when you believe the addition will not be helpful to the project, the team maintaining it, and by extension, its users.",
    "page": null,
    "language": "en"
   },
   {
    "id": "29962286738589c41897e027258c398d2bcc23cd",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "small discrepancies give the impression of individual developers working without purpose rather than a team working together toward a common goal.",
    "page": null,
    "language": "en"
   },
   {
    "id": "94d61511693fb0ed2a374124a587362440e97412",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "Lack of attention to detail conveys an attitude that might permeate other aspects of a project like readability, dependency management, and testing.",
    "page": null,
    "language": "en"
   },
   {
    "id": "d1549f66c3452a7d568ef559f5e51293461bf3d5",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "An inconsistent style is a superficial but notable sign that people don’t care much about quality.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "de9ccf2d97e31d668859ca9e30e3b746cc714a51",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "If you write ugly code, anyone who intends to fix a bug or add a feature will not enjoy their work and likely avoid it next time.",
    "page": null,
    "language": "en"
   },
   {
    "id": "ae14e7980df51eb88854ad55f3a9308d652d0be9",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "You can write the coding standard for your project or adopt an existing one, and follow it. Any guideline will be useful, as any one of them will handle a myriad of little decisions for you and your team so you don’t need to think about them too. In many cases it doesn’t matter what decisions these are; the point is to avoid having to discuss them frequently.",
    "page": null,
    "language": "en"
   },
   {
    "id": "efd16f4dfd6545db90b26264189280b6a115ccf9",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "lack of process is what gets us to new discoveries. Not everything has to feel cookie cut, particularly for explorations.",
    "page": null,
    "language": "en"
   },
   {
    "id": "6188cf2fb165b2382b3637fcecd93d5a9793fec9",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "In any piece of documentation in your project there shouldn’t be words like obviously, basically, simply, easy, etc. In the case where it’s not obvious they might trigger feelings of vulnerability (“why didn’t I already know this?”). And in the case where it was indeed a known fact, the word doesn’t add any information,",
    "page": null,
    "language": "en"
   },
   {
    "id": "fbd1d38a3049b1e66705662626b5a7d4c9fe8d08",
    "book": {
     "title": "maintaining-open-source-projects",
     "highlights": [],
     "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
    },
    "text": "Godwin’s law states that as an online discussion grows longer (regardless of topic or scope), sooner or later someone will compare someone or something to Hitler or Nazism.",
    "page": null,
    "language": "en"
   }
  ],
  "id": "41ba657f8df83b9b9eeb6c8cacfdcb69c3e350cd"
 },
 {
  "title": "Clean Code ",
  "author": "Robert C. Martin",
  "highlights": [
   {
    "id": "2dc8dc92d9286e83d87f12b9ad552d72e840544d",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "it is through practice in the small that professionals gain proficiency and trust for practice in the large.",
    "page": null,
    "language": "en"
   },
   {
    "id": "c0dd030f47a9f6a7fec2cf897c14e89657d4fab9",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "We know good code matters because we’ve had to deal for so long with its lack.",
    "page": null,
    "language": "en"
   },
   {
    "id": "066b526442d6d816d233ec53e06386e97e833bbb",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "LeBlanc’s law: Later equals never.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "6fbbe64883e3b31f8f6442c996eaab724e026e3b",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "We are deeply complicit in the planning of the project and share a great deal of the responsibility for any failures; especially if those failures have to do with bad code!",
    "page": null,
    "language": "en"
   },
   {
    "id": "3a02af212a69252865df8a6d2e2218ece7ae756b",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Most managers want the truth, even when they don’t act like it. Most managers want good code, even when they are obsessing about the schedule. They may defend the schedule and requirements with passion; but that’s their job. It’s your job to defend the code with equal passion.",
    "page": null,
    "language": "en"
   },
   {
    "id": "ff7fbe08adfd0232f8a27d37a1746b3d4207f8a4",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "what if you were a doctor and had a patient who demanded that you stop all the silly hand-washing in preparation for surgery because it was taking too much time?2 Clearly the patient is the boss; and yet the doctor should absolutely refuse to comply. Why? Because the doctor knows more than the patient about the risks of disease and infection. It would be unprofessional (never mind criminal) for the doctor to comply with the patient.",
    "page": null,
    "language": "en"
   },
   {
    "id": "81539e65a383f7746d1d4957d62461d4fa3ce5dc",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "All developers with more than a few years experience know that previous messes slow them down. And yet all developers feel the pressure to make messes in order to meet deadlines.",
    "page": null,
    "language": "en"
   },
   {
    "id": "c0cb0dffcfb1e858dfec815c0b56175f6587af3d",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "You will not make the deadline by making the mess. Indeed, the mess will slow you down instantly, and will force you to miss the deadline.",
    "page": null,
    "language": "en"
   },
   {
    "id": "299b0b0c7f472e0b4356d5aeaef372ddd6e5c032",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "writing clean code is a lot like painting a picture. Most of us know when a picture is painted well or badly. But being able to recognize good art from bad does not mean that we know how to paint.",
    "page": null,
    "language": "en"
   },
   {
    "id": "8005bc612b64aec72b7bbb32a256c2380c3fb340",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "A building with broken windows looks like nobody cares about it. So other people stop caring. They allow more windows to become broken. Eventually they actively break them. They despoil the facade with graffiti and allow garbage to collect. One broken window starts the process toward decay.",
    "page": null,
    "language": "en"
   },
   {
    "id": "b18156de5ae86a7e7a484de88ea1aed1ec7dd548",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Bad code tries to do too much, it has muddled intent and ambiguity of purpose. Clean code is focused.",
    "page": null,
    "language": "en"
   },
   {
    "id": "73474a3387dcaf36e8cabb7e395b1619bda22c56",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "the ratio of time spent reading vs. writing is well over 10:1. We are constantly reading old code as part of the effort to write new code. Because this ratio is so high, we want the reading of code to be easy, even if it makes the writing harder. Of course there’s no way to write code without reading it, so making it easy to read actually makes it easier to write.",
    "page": null,
    "language": "en"
   },
   {
    "id": "efe7a013fae760f7e1f547f32c636c6be5adb8f7",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "The Boy Scouts of America have a simple rule that we can apply to our profession. Leave the campground cleaner than you found it.",
    "page": null,
    "language": "en"
   },
   {
    "id": "8acd8f0908c9b49fd320bf7aa2cb68711ae7a86e",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "If we all checked-in our code a little cleaner than when we checked it out, the code simply could not rot.",
    "page": null,
    "language": "en"
   },
   {
    "id": "9fe3cc3848662a26c6e340eb7075979e4d3fb804",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Names are everywhere in software. We name our variables, our functions, our arguments, classes, and packages. We name our source files and the directories that contain them. We name our jar files and war files and ear files. We name and name and name. Because we do so much of it, we’d better do it well.",
    "page": null,
    "language": "en"
   },
   {
    "id": "1837b2daa6315c97eb26d6de9e606f129c24c517",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Choosing good names takes time but saves more than it takes.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "023284defbf5583f0917a219f4acfe5ae58f990e",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "The name of a variable, function, or class, should answer all the big questions. It should tell you why it exists, what it does, and how it is used. If a name requires a comment, then the name does not reveal its intent.    int d; // elapsed time in days The name d reveals nothing. It does not evoke a sense of elapsed time, nor of days. We should choose a name that specifies what is being measured and the unit of that measurement:    int elapsedTimeInDays;    int daysSinceCreation;    int daysSinceModification;    int fileAgeInDays;",
    "page": null,
    "language": "en"
   },
   {
    "id": "9b40a5f02a8f897aaf78a261b83ea885ca0b887a",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Beware of using names which vary in small ways. How long does it take to spot the subtle difference between a XYZControllerForEfficientHandlingOfStrings in one module and, somewhere a little more distant, XYZControllerForEfficientStorageOfStrings? The words have frightfully similar shapes.",
    "page": null,
    "language": "en"
   },
   {
    "id": "234700e0936792bc8ff05f023b1b423fde212a9c",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "It is not sufficient to add number series or noise words, even though the compiler is satisfied. If names must be different, then they should also mean something different.",
    "page": null,
    "language": "en"
   },
   {
    "id": "d8a02acfcdbad17eeed63cd06e485f0bbcbe4151",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Number-series naming (a1, a2, .. aN) is the opposite of intentional naming. Such names are not disinformative—they are noninformative; they provide no clue to the author’s intention. Consider:    public static void copyChars(char a1[], char a2[]) {      for (int i = 0; i < a1.length; i++) {        a2[i] = a1[i];      }    } This function reads much better when source and destination are used for the argument names.",
    "page": null,
    "language": "en"
   },
   {
    "id": "25346bc2a0257a63cad0d9ca1349a80ed59c75aa",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Imagine that you have a Product class. If you have another called ProductInfo or ProductData, you have made the names different without making them mean anything different.",
    "page": null,
    "language": "en"
   },
   {
    "id": "9566f2b6ba2726c7b5064df27231df0f5e95b370",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "the variable moneyAmount is indistinguishable from money, customerInfo is indistinguishable from customer, accountData is indistinguishable from account, and theMessage is indistinguishable from message. Distinguish names in such a way that the reader knows what the differences offer.",
    "page": null,
    "language": "en"
   },
   {
    "id": "45275cad68b6ed475a50076417a275d6b60e6219",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "make your names pronounceable. If you can’t pronounce it, you can’t discuss it without sounding like an idiot.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "6496797e3e9057d28c61eed5d0b5b3ae83f550fa",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Single-letter names and numeric constants have a particular problem in that they are not easy to locate across a body of text. One might easily grep for MAX_CLASSES_PER_STUDENT, but the number 7 could be more troublesome.",
    "page": null,
    "language": "en"
   },
   {
    "id": "08fba0fe4337b07f261287e0ae04549f184626fd",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "single-letter names can ONLY be used as local variables inside short methods. The length of a name should correspond to the size of its scope [N5]. If a variable or constant might be seen or used in multiple places in a body of code, it is imperative to give it a search-friendly name.",
    "page": null,
    "language": "en"
   },
   {
    "id": "45ce7d2b2404000e2c7bbc5441dee85674675bed",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Classes and objects should have noun or noun phrase names like Customer, WikiPage, Account, and AddressParser. Avoid words like Manager, Processor, Data, or Info in the name of a class. A class name should not be a verb.",
    "page": null,
    "language": "en"
   },
   {
    "id": "34175a3e2ee330dbff93530d442173475508456c",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Methods should have verb or verb phrase names like postPayment, deletePage, or save.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "050d4bb574cab77d1ff6401ea54a497c9e2a2583",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Pick one word for one abstract concept and stick with it. For instance, it’s confusing to have fetch, retrieve, and get as equivalent methods of different classes.",
    "page": null,
    "language": "en"
   },
   {
    "id": "a28423ef799dafd14d9379c4fd2ca1200402def0",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Remember that the people who read your code will be programmers. So go ahead and use computer science (CS) terms, algorithm names, pattern names, math terms, and so forth.",
    "page": null,
    "language": "en"
   },
   {
    "id": "a9db38977b8f762726215465621b83e9becca8a9",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "you need to place names in context for your reader by enclosing them in well-named classes, functions, or namespaces. When all else fails, then prefixing the name may be necessary as a last resort.",
    "page": null,
    "language": "en"
   },
   {
    "id": "9a3691ef44cce75f3a36e23c8bd9a56eddb85805",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "Shorter names are generally better than longer ones, so long as they are clear.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "8c1e379673da6e8cbede187891c9ff486c94b0a4",
    "book": {
     "title": "Clean Code ",
     "author": "Robert C. Martin",
     "highlights": [],
     "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
    },
    "text": "People are also afraid of renaming things for fear that some other developers will object. We do not share that fear and find that we are actually grateful when names change (for the better).",
    "page": null,
    "language": "en"
   }
  ],
  "id": "becbfcc780e7a6aa7e801ea44660650cac8c4ab2"
 },
 {
  "title": "Practical Go: Real world advice for writing maintainable Go programs ",
  "author": "The Pragmatic Programmer",
  "highlights": [
   {
    "id": "f0872f7ea06211ff472f3dea51ce901bacc5c3f0",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Complexity turns reliable software in unreliable software. Complexity is what kills software projects. Therefore simplicity is the highest goal of Go.",
    "page": null,
    "language": "en"
   },
   {
    "id": "164f0171a005b367a420ec27eee554f17fafc271",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Programs must be written for people to read, and only incidentally for machines to execute. — Hal Abelson and Gerald Sussman",
    "page": null,
    "language": "en"
   },
   {
    "id": "5fffdc2da93d2c3cbe73d4912e3497dc34e9a28e",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "all software, not just Go programs, is written by humans to be read by other humans. The fact that software is also consumed by machines is secondary.",
    "page": null,
    "language": "en"
   },
   {
    "id": "0a790d94cb9bc78c74ab170433ffa9b6ebc53f88",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Readability is key to being able to understand what the program is doing. If you can’t understand what a program is doing, how can you hope to maintain it? If software cannot be maintained, then it will be rewritten;",
    "page": null,
    "language": "en"
   },
   {
    "id": "d009ba8c4fdb27e85a88ce86f032537a4a6d75b5",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Go programmers realise that code is written to be read and so place the act of reading code above the act of writing it. Go goes so far as to enforce, via tooling and custom, that all code be formatted in a specific style. This removes the friction of learning a project specific dialect and helps spot mistakes because they just look incorrect.",
    "page": null,
    "language": "en"
   },
   {
    "id": "065fadeaba920d6ad2d23674c39b5f0ebe9baf63",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Good naming is like a good joke. If you have to explain it, it’s not funny. — Dave Cheney",
    "page": null,
    "language": "en"
   },
   {
    "id": "2e0853461e8efee43fb2ab7e29fccd6475ecdb87",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Good names have a high signal to noise ratio.",
    "page": null,
    "language": "en"
   },
   {
    "id": "84b098ae3e806d21641c7240098ead9952dcc178",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "A good name should describe the application of a variable or constant, not their contents.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "cd6de78aae7c9a37c477115f904f3add034a0b4e",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Short variable names work well when the distance between their declaration and last use is short. Long variable names need to justify themselves; the longer they are the more value they need to provide. Lengthy bureaucratic names carry a low amount of signal compared to their weight on the page. Don’t include the name of your type in the name of your variable. Constants should describe the value they hold, not how that value is used.",
    "page": null,
    "language": "en"
   },
   {
    "id": "fcd555674d21c60886f9f715c56af393decc7068",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "The greater the distance between a name’s declaration and its uses, the longer the name should be. — Andrew Gerrand [] From this we can draw some guidelines: Short variable names work well when the distance between their declaration and last use is short. Long variable names need to justify themselves; the longer they are the more value they need to provide. Lengthy bureaucratic names carry a low amount of signal compared to their weight on the page. Don’t include the name of your type in the name of your variable. Constants should describe the value they hold, not how that value is used.",
    "page": null,
    "language": "en"
   },
   {
    "id": "bcc3a32276e32c27bb3e1f77197b72f4459d01bf",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Use blank lines to break up the flow of a function in the same way you use paragraphs to break up the flow of a document.",
    "page": null,
    "language": "en"
   },
   {
    "id": "a20a7b586063c27bc86b0ff3cec5a913a2c07c68",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "You shouldn’t name your variables after their types for the same reason you don’t name your pets \"dog\" and \"cat\".",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "9af27b8ddeb51d8057364c2b65f823d3fe2c5490",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "The reader should be able to understand the use of a name when they encounter it for the first time. When they encounter a common name, they should be able to assume it has not changed meanings since the last time they saw it.",
    "page": null,
    "language": "en"
   },
   {
    "id": "0c5601987a735a8c6daaa7884e4cadcc6f4d684f",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "When declaring and initialising the variable at the same time, that is to say we’re not letting the variable be implicitly initialised to its zero value, I recommend using the short variable declaration form. This makes it clear to the reader that the variable on the left hand side of the := is being deliberately initialised.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "38d631ca924e0f765cb86077249369370007aea6",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Changing styles in the middle of a file is jarring. Uniformity, even if its not your preferred approach, is more valuable for maintenance than your personal preference.",
    "page": null,
    "language": "en"
   },
   {
    "id": "5ffafbef9dd5ce5ec501bbd0056b976e951acdee",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "If you want to do a renaming across a code-base, do not mix this into another change. If someone is using git bisect they don’t want to wade through thousands of lines of renaming to find the code you changed as well.",
    "page": null,
    "language": "en"
   },
   {
    "id": "f24765cec3924a882c786a9eb83870aa3118cdb0",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Functions should do one thing only. If you find yourself commenting a piece of code because it is unrelated to the rest of the function, consider extracting it into a function of its own.",
    "page": null,
    "language": "en"
   },
   {
    "id": "9c5b100ede0259089954b03b0058d70d56399ae6",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Each Go package is in effect it’s own small Go program. Just as the implementation of a function or method is unimportant to the caller, the implementation of the functions, methods and types that comprise your package’s public API—​its behaviour—​is unimportant for the caller.",
    "page": null,
    "language": "en"
   },
   {
    "id": "4bf43a5c30a51a045d893d1d8062a9096697d4d4",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Name your package for what it provides, not what it contains.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "730c2c3ee631136ec156750166d5b6ba9a31bc06",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "[A little] duplication is far cheaper than the wrong abstraction. — Sandy Metz",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "11cdad998bc7b36b3f7cf26df578a320bf3150f5",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "Rather than the successful path nesting deeper and deeper to the right, Go code is written in a style where the success path continues down the screen as the function progresses. My friend Mat Ryer calls this practice 'line of sight' coding. [] This is achieved by using guard clauses; conditional blocks with assert preconditions upon entering a function.",
    "page": null,
    "language": "en"
   },
   {
    "id": "b2bb5d527e46e00313ffe3029c22ca3bfab99ddc",
    "book": {
     "title": "Practical Go: Real world advice for writing maintainable Go programs ",
     "author": "The Pragmatic Programmer",
     "highlights": [],
     "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
    },
    "text": "The key to writing maintainable programs is that they should be loosely coupled—​a change to one package should have a low probability of affecting another package that does not directly depend on the first. There are two excellent ways to achieve loose coupling in Go Use interfaces to describe the behaviour your functions or methods require. Avoid the use of global state.",
    "page": null,
    "language": "en"
   }
  ],
  "id": "3bf5c678ac1d37109aed99393dd2a660c1eaf25e"
 },
 {
  "title": "Remote ",
  "author": "Heinemeier Hansson, David",
  "highlights": [
   {
    "id": "6fcb9098d183ed7889e696a4252e66dec100cb07",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "If you ask people where they go when they really need to get work done, very few will respond “the office.”",
    "page": null,
    "language": "en"
   },
   {
    "id": "180d85725d2b0f395317ef9cc7cb20d076cdf9c7",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "The ability to be alone with your thoughts is, in fact, one of the key advantages of working remotely.",
    "page": null,
    "language": "en"
   },
   {
    "id": "ce1c8e84efaf71ab1e08e74469a1e42dfbf5a222",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "The big transition with a distributed workforce is going from synchronous to asynchronous collaboration. Not only do we not have to be in the same spot to work together, we also don’t have to work at the same time to work together.",
    "page": null,
    "language": "en"
   },
   {
    "id": "c133abd48a7fb0cf9fceb4cc51edb4d1fbe66e57",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "Your life no longer needs to be divided into arbitrary phases of work and retirement. You can blend the two for fun and profit—design a better lifestyle that makes work enjoyable because it’s not the only thing on the menu.",
    "page": null,
    "language": "en"
   },
   {
    "id": "08a41dc083a5d2ee9ba4b6da4a15b4702a81fb9e",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "The new luxury is the luxury of freedom and time. Once you’ve had a taste of that life, no corner office or fancy chef will be able to drag you back.",
    "page": null,
    "language": "en"
   },
   {
    "id": "7dcf5153f766a96b1acd09a59ca56e4134ff8aca",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "Letting people work remotely is about promoting quality of life, about getting access to the best people wherever they are,",
    "page": null,
    "language": "en"
   },
   {
    "id": "67fe17f3225cb409b979dc8c341732236ff3e3a6",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "coming into the office just means that people have to put on pants. There’s no guarantee of productivity.",
    "page": null,
    "language": "en"
   },
   {
    "id": "e2af4bbd5b94b3834a9f3dcc0bac676048614d5c",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "if you can’t let your employees work from home out of fear they’ll slack off without your supervision, you’re a babysitter, not a manager.",
    "page": null,
    "language": "en"
   },
   {
    "id": "b65c0a01ecfbb5dd70e58332a7a5e486b365c390",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "you shouldn’t hire people you don’t trust, or work for bosses who don’t trust you.",
    "page": null,
    "language": "en"
   },
   {
    "id": "7cb19913eadbcea7772374e55fe3d66161b9a228",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "Most people want to work, as long as it’s stimulating and fulfilling. And if you’re stuck in a dead-end job that has no prospects of being either, then you don’t just need a remote position—you need a new job.",
    "page": null,
    "language": "en"
   },
   {
    "id": "5e32f87383c0fe02d11049772d1c8d5fdbffa69f",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "Culture isn’t a foosball table. It’s not a paintball outing in the forest. It’s not even the Christmas party where Steve got so drunk that everyone had a good story for the rest of the year. That’s people hanging out and having a good time. No, culture is the spoken and unspoken values and actions of the organization.",
    "page": null,
    "language": "en"
   },
   {
    "id": "3ac12aae2bc0f05d623a5a64e90ccc393feab5bb",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "not every question needs an answer immediately—there’s nothing more arrogant than taking up someone else’s time with a question you don’t need an answer to right now. That means realizing that not everything is equally important.",
    "page": null,
    "language": "en"
   },
   {
    "id": "36312872bee92ebbbb24673ef8e43ada11d1e38e",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "Questions you can wait hours to learn the answers to are fine to put in an email. Questions that require answers in the next few minutes can go into an instant message. For crises that truly merit a sky-is-falling designation, you can use that old-fashioned invention called the telephone.",
    "page": null,
    "language": "en"
   },
   {
    "id": "304e035bda1a424e5a224a2fe1bbb2157c0d08d6",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "avoid locking up important stuff in a single person’s computer or inbox. Put all the important stuff out in the open,",
    "page": null,
    "language": "en"
   },
   {
    "id": "53ecfeccaa893353909ffe3b5b06fb614a70c8df",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "you, the remote worker, are in control of your social interaction—when it happens and how much of it you need. At first it might simply seem like a waste of time, especially if you’re not already used to reading Reddit on the side, but it’s a quality waste of time with your coworkers. We all need that.",
    "page": null,
    "language": "en"
   },
   {
    "id": "931cf2b0c63e23eadf8c537ea841891fa6e9d968",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "At 37signals we’ve institutionalized this through a weekly discussion thread with the subject “What have you been working on?” Everyone chimes in with a few lines about what they’ve done over the past week and what’s intended for the next week. It’s not a precise, rigorous estimation process, and it doesn’t attempt to deal with coordination. It simply aims to make everyone feel like they’re in the same galley and not their own little rowboat.",
    "page": null,
    "language": "en"
   },
   {
    "id": "2d0cfe1a16c005c72cdc06418c877100baaad4b8",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "When meetings are the norm, the first resort, the go to tool to discuss, debate, and solve every problem, they become overused and we grow numb to the outcome. Meetings should be like salt—sprinkled carefully to enhance a dish, not poured recklessly over every forkful. Too much salt destroys a dish. Too many meetings can destroy morale and motivation.",
    "page": null,
    "language": "en"
   },
   {
    "id": "10530d9cb3408fb91da6bfd2693cf5c37f5a73b0",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "You need solid writers to make remote work work, and a solid command of your home language is key.",
    "page": null,
    "language": "en"
   },
   {
    "id": "aa46a862705b64978aa6673d6d21910a1df58060",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "the human connection is even more important when hiring remote workers because it has to be stronger to survive the distance.",
    "page": null,
    "language": "en"
   },
   {
    "id": "94f1256f225940b6d4809e90d0653ef68eb89465",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "Being a good writer is an essential part of being a good remote worker. When most arguments are settled over email or chat or discussion boards, you’d better show up equipped for the task.",
    "page": null,
    "language": "en"
   },
   {
    "id": "b3a35fccaff0b2d9cf490dbd2de9fc53f9389f8b",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "Working remotely blows a big fat hole in that style of management. If I can’t see workers come in and leave their desks, how on earth can I make sure they’re actually working? Or so goes the naïve thinking of a manager of chairs.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "44b8b75d5c283cfa0535ece82190641f5314945f",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "If you treat remote workers like second-class citizens, you’re all going to have a bad time. The lower the ratio of remote worker to office worker, the more likely this is to happen.",
    "page": null,
    "language": "en"
   },
   {
    "id": "dd1612ed73834393c8eaef7b1e6a8863b6b90fb3",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "As a company owner or manager, you need to create and maintain a level playing field—one on which those in and out of the office stand as equals.",
    "page": null,
    "language": "en"
   },
   {
    "id": "00312ddfbf33c5abf457b49b48a260cc2bae57c5",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "Start by empowering everyone to make decisions on their own. If the company is full of people whom nobody trusts to make decisions without layers of managerial review, then the company is full of the wrong people.",
    "page": null,
    "language": "en"
   },
   {
    "id": "a002620cd6188132b264dae9f6c80ce5e75afa68",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "you might think that the major risk in setting your people free is that they’ll turn into lazy, unproductive slackers. In reality, it’s overwork, not underwork, that’s the real enemy in a successful remote-working environment",
    "page": null,
    "language": "en"
   },
   {
    "id": "7487cd79863fa89f799cdc52c0b9dd2cbf7e7808",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "If work is all-consuming, the worker is far more likely to burn out. This is true even if the person loves what he does. Perhaps especially if he loves what he does, since it won’t seem like a problem until it’s too late.",
    "page": null,
    "language": "en"
   },
   {
    "id": "7d60dc9bccee7ab742b3698472894b7fa3613136",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "make face-to-face harder and less frequent and you’ll see the value of these interactions go up, not down.",
    "page": null,
    "language": "en"
   },
   {
    "id": "58a209d9e272be12d72613910d295b5f85a15892",
    "book": {
     "title": "Remote ",
     "author": "Heinemeier Hansson, David",
     "highlights": [],
     "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
    },
    "text": "Motivation is the fuel of intellectual work. You can get several days’ worth of work completed in one motivation-turboed afternoon. Or, when you’re motivation starved, you can waste a week getting a day’s worth of work done.",
    "page": null,
    "language": "en"
   }
  ],
  "id": "25f3515dc250c2fa86418be81a7e295bebf086f6"
 },
 {
  "title": "Kubernetes - App Development ",
  "author": "Matthew Palmer",
  "highlights": [
   {
    "id": "c602853311f65cd3ed4d8318c345b3f12ffdedfa",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "A cluster is a collection of computers coordinated to work as a single unit. In Kubernetes this consists of a master node and worker nodes.",
    "page": null,
    "language": "en"
   },
   {
    "id": "0708b19c708e3864a1cf90ec5d90a6c6c536683d",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "etcd A distributed key-value store used in Kubernetes to store configuration data for the cluster.",
    "page": null,
    "language": "en"
   },
   {
    "id": "6855b6f61ef95320f151923a8eaf40d5b1ff9c36",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Controller Controllers are responsible for updating resources in Kubernetes based on changes to data in etcd.",
    "page": null,
    "language": "en"
   },
   {
    "id": "cdcb4a75c82123e61c5bbcb2ed238b956dcfcfd3",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "scheduler A module in the Kubernetes master that selects which worker node a pod should run on, based on resource requirements.",
    "page": null,
    "language": "en"
   },
   {
    "id": "c9e24310a71bce2a8a115aa2e72ca11f452f7121",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "node A worker machine in the Kubernetes cluster, responsible for actually running pods.",
    "page": null,
    "language": "en"
   },
   {
    "id": "144133e457050e137b64f0609f37a6c8891f4367",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "takes responsibility for containers that run on that node.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "4d90cb910990b388a9b02f74641d1803aac1bb87",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "kubelet A process that runs on each worker node, and takes responsibility for containers that run on that node.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "6df44837c205925d1c4b5d142f46d6e020ba2035",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "containers to be colocated and share filesystem and network resources.",
    "page": null,
    "language": "en"
   },
   {
    "id": "e7c63d8545e19d60cc49046137a9d05d22dc9875",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Pod The smallest object that Kubernetes interacts with. It is a layer of abstraction around the container, allowing for containers to be colocated and share filesystem and network resources.",
    "page": null,
    "language": "en"
   },
   {
    "id": "6d073acf2f2d8c69f9c8a56fa42c8734598d3778",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Service A Kubernetes object used to expose a dynamic set of pods to the network behind a single interface.",
    "page": null,
    "language": "en"
   },
   {
    "id": "c39f7ef31685dfbf202dc7badcf0666d061206db",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Deployment A Kubernetes object that manages a set of pods as a single unit, controlling their replication, update, and rollback.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "90af907211102baf46c727c903388988ffffcd76",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Liveness Probe A process that checks if a container is still alive or if it needs to be restarted.",
    "page": null,
    "language": "en"
   },
   {
    "id": "cc07b012a159957fa78fb5d8fdac37f26aac1dd4",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Readiness Probe A process that checks if a container has started successfully and is ready to start receiving requests.",
    "page": null,
    "language": "en"
   },
   {
    "id": "fb0912e5b05f7b627a849e81cb2e4289a3be968d",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Sidecar pattern A multi-container design pattern where another container runs alongside your main application and performs some task non-essential to the application container.",
    "page": null,
    "language": "en"
   },
   {
    "id": "46da38e11299459b247568817d64be2473caac73",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Adapter pattern A multi-container design pattern where an adapter container massages the output or formatting of your main application so that it can be consumed by another party.",
    "page": null,
    "language": "en"
   },
   {
    "id": "6c908dcd5b19b89437c822dca6596ecb54c2ee99",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Ambassador pattern A multi-container design pattern where the ambassador container proxies network requests to a third party. The main application makes requests to localhost, and the ambassador is responsible for forwarding those requests to the external service.",
    "page": null,
    "language": "en"
   },
   {
    "id": "10769846c9d63157a2f1c28f3b32d7f088ae7f9d",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Volume mount The mechanism by which a container gains access to a volume. The container declares a volume mount, and then it can read or write to that path as though it were a symbolic link to the volume.",
    "page": null,
    "language": "en"
   },
   {
    "id": "174e38edd3c921bca3a00748e7c463da5f696473",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Volume A piece of storage in a Kubernetes pod that lives for (at least) as long as the pod is alive. Analogous to a directory in your filesystem.",
    "page": null,
    "language": "en"
   },
   {
    "id": "7804b9d04f0ec5dc2bac9d4eaf54cc0d92168335",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Second—how do I get to the ideal state? Kubernetes",
    "page": null,
    "language": "en"
   },
   {
    "id": "928383619d77a4ac62e33cdf33866433b3ddf62a",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Kubernetes has a group of controllers whose job it is to make the actual cluster state match the ideal state.",
    "page": null,
    "language": "en"
   },
   {
    "id": "aaf40f9b528771da052116f3af4b667aeb99c0d6",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "gives access to the Kubernetes API via a HTTP REST API.",
    "page": null,
    "language": "en"
   },
   {
    "id": "41091e1926d998f8f75f18a0093084b176f5b247",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Kubernetes is told to run a new pod, scale a deployment, or maybe to add more storage. The request is made through the API server (kube-apiserver), a process inside the master that gives access to the Kubernetes API via a HTTP REST API.",
    "page": null,
    "language": "en"
   },
   {
    "id": "6961e7b18e9dc47c7150ad77df837e4599c748e9",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "kube-scheduler determines which node should run a pod. It finds new pods that don't have a node assigned, looks at the cluster's overall resource utilisation, hardware and software policies, node affinity, and deadlines, and then decides which node should run that pod.",
    "page": null,
    "language": "en"
   },
   {
    "id": "d5bbd9905e91d597fcac7b16705dab29e2b241d7",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "The master maintains the actual and desired state of the cluster using etcd, lets users and nodes change the desired state via the kube-apiserver, runs controllers that reconcile these states, and the kube-scheduler assigns pods to a node to run.",
    "page": null,
    "language": "en"
   },
   {
    "id": "6c50b2ce31dde6a5e07326de7629b9f7a68d3022",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Every node in a Kubernetes cluster has a container runtime, a Kubernetes node agent, a networking proxy, and a resource monitoring service.",
    "page": null,
    "language": "en"
   },
   {
    "id": "0120fcf57c1811d822384d72f8cb7a098dc4fa8b",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "The container runtime is responsible for actually running the containers that you specify.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "2e22a915446d3f17978f95f04e1a42315a93ed79",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "kubelet is a process that runs on each node that takes responsibility for the state of that node. It starts and stops containers as directed by the master, and ensures that its containers remain healthy. It will also track the state of each of its pods, and if a pod is not in its desired state, it will be redeployed. kubelet must also relay its health to the master every few seconds. If the master sees that a node has failed (i.e. kubelet has failed to report that the node is healthy), controllers will see this change and relaunch pods on healthy nodes.￼",
    "page": null,
    "language": "en"
   },
   {
    "id": "01c149defe562abc416b980de95d9a16c18835c3",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Every Kubernetes node also requires a networking proxy (kube-proxy) so that it can communicate with other services in the cluster and the master node. This process is responsible for routing networking traffic to the relevant container and other networking operations.",
    "page": null,
    "language": "en"
   },
   {
    "id": "6f0e00992240a162f21e8209ae7723e553c7030a",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Every Kubernetes node also runs cAdvisor, a simple agent that monitors the performance and resource usage of containers on the node.",
    "page": null,
    "language": "en"
   },
   {
    "id": "5d0e259dc3957008af0fb11e759eb7637b61f0bd",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "When should you combine multiple containers into a single pod? When the containers have the exact same lifecycle, when the containers share filesystem resources, or when the containers must run on the same node.",
    "page": null,
    "language": "en"
   },
   {
    "id": "4e25622bd5be948ae3256ddc4997245aa0838b2e",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "application to always connect to localhost, and let the responsibility of mapping this connecting to the right database fall to an ambassador container.",
    "page": null,
    "language": "en"
   },
   {
    "id": "e0386663f2713e2b7e98a5fae537df806b1705b3",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "You can think of selectors as the WHERE part of a SELECT * from pods WHERE <labels> = <values>. You use label selectors from the command line or in an object’s YAML when it needs to select other objects.",
    "page": null,
    "language": "en"
   },
   {
    "id": "463a4173372bf34d6d81b28432b5abc81470ee81",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "one of the most common uses of labels and selectors is to group pods into a service. The selector field in a service's spec defines which pods receive requests sent to that service.",
    "page": null,
    "language": "en"
   },
   {
    "id": "6ae508a26f980defc2558717aa0b1bca8aa98270",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Deployments in Kubernetes let you manage a set of identical pods",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "89b9b7c9bf862baf951b75cda3c26a4fb6b088b3",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "RollingUpdate The preferred and more commonly used strategy is RollingUpdate. This gracefully updates pods one at a time to prevent your application from going down. The strategy gradually brings pods with the new configuration online, while killing old pods as the new configuration scales up.",
    "page": null,
    "language": "en"
   },
   {
    "id": "7435fe4974322610e2f2f53fb8b3b33d8fc61822",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "there are two useful fields you can configure.   maxUnavailable effectively determines the minimum number of pods you want running in your deployment as it updates. For example, if we have a deployment currently running ten pods and a maxUnavailable value of 4. When an update is triggered, Kubernetes will immediately kill four pods from the old configuration, bringing our total to six. Kubernetes then starts to bring up the new pods, and kills old pods as they come alive. Eventually the deployment will have ten replicas of the new pod, but at no point during the update were there fewer than six pods available.   maxSurge determines the maximum number of pods you want running in your deployment as it updates. In the previous example, if we specified a maxSurge of 3, Kubernetes could immediately create three copies of the new pod, bringing the total to 13, and then begin killing off the old versions.",
    "page": null,
    "language": "en"
   },
   {
    "id": "3b9105facd46d9b5ae570d1b18f8976206c3c8e9",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "When updating your deployment with RollingUpdate, there are two useful fields you can configure.   maxUnavailable effectively determines the minimum number of pods you want running in your deployment as it updates. For example, if we have a deployment currently running ten pods and a maxUnavailable value of 4. When an update is triggered, Kubernetes will immediately kill four pods from the old configuration, bringing our total to six. Kubernetes then starts to bring up the new pods, and kills old pods as they come alive. Eventually the deployment will have ten replicas of the new pod, but at no point during the update were there fewer than six pods available.   maxSurge determines the maximum number of pods you want running in your deployment as it updates. In the previous example, if we specified a maxSurge of 3, Kubernetes could immediately create three copies of the new pod, bringing the total to 13, and then begin killing off the old versions.",
    "page": null,
    "language": "en"
   },
   {
    "id": "80cfb76dec3140dda1e964a17dd9d0dc0f29f3d8",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "A deployment's entire rollout and configuration history is tracked in Kubernetes, allowing for powerful undo and redo functionality. You can easily rollback to a previous version of your deployment at any time.",
    "page": null,
    "language": "en"
   },
   {
    "id": "d645793950cac299c91cc5834ee8bd2fc0f06a62",
    "book": {
     "title": "Kubernetes - App Development ",
     "author": "Matthew Palmer",
     "highlights": [],
     "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
    },
    "text": "Services let you define networking rules for pods based on their labels. Whenever a pod with a matching label appears in the Kubernetes cluster, the service will detect it and start using it to handle network requests made to the service.",
    "page": null,
    "language": "en"
   }
  ],
  "id": "6e0dedeba45d4bfabde8dde4f8076e5d310c9d15"
 },
 {
  "title": "Breves respuestas a las grandes preguntas (Spanish Edition) ",
  "author": "Hawking, Stephen",
  "highlights": [
   {
    "id": "4f426863db5cdc30985d139be4765fdfc42ccec7",
    "book": {
     "title": "Breves respuestas a las grandes preguntas (Spanish Edition) ",
     "author": "Hawking, Stephen",
     "highlights": [],
     "id": "174dd0fcd9843657228957fec51311eab60e9401"
    },
    "text": "principio antrópico dice que el universo tiene que ser más o menos como lo vemos, porque si fuera diferente no habría nadie para observarlo",
    "page": null,
    "language": "es"
   },
   {
    "id": "166ad2d47c7c6bb91a6967d268ec7f87b0049fea",
    "book": {
     "title": "Breves respuestas a las grandes preguntas (Spanish Edition) ",
     "author": "Hawking, Stephen",
     "highlights": [],
     "id": "174dd0fcd9843657228957fec51311eab60e9401"
    },
    "text": "A primera vista, parece notable que el universo esté tan finamente sintonizado. Tal vez esto es evidencia de que el universo fue especialmente diseñado para producir la especie humana. Sin embargo, tenemos que ir con cuidado con tales argumentos, que se conocen como Principio Antrópico. Este principio se basa en la evidencia de que si el universo no hubiera sido adecuado para la vida, no estaríamos aquí, preguntándonos por qué está equilibrado tan finamente.",
    "page": null,
    "language": "es"
   },
   {
    "id": "b228cc4c9807eeac6efda89f6cfa08c4bd7abcfc",
    "book": {
     "title": "Breves respuestas a las grandes preguntas (Spanish Edition) ",
     "author": "Hawking, Stephen",
     "highlights": [],
     "id": "174dd0fcd9843657228957fec51311eab60e9401"
    },
    "text": "Werner Heisenberg, otro físico alemán, señaló que no se podía medir simultánea y exactamente la posición y la velocidad de una partícula. Para ver dónde está una partícula hay que iluminarla. Pero según el trabajo de Planck, no se puede usar una cantidad arbitrariamente pequeña de luz. Se tiene que usar al menos un cuanto. Este perturbará la partícula y cambiará su velocidad de una manera que no puede predecirse. Para medir con precisión la posición de la partícula, se tendrá que usar luz de longitud de onda corta, como por ejemplo rayos ultravioleta, rayos X o gamma. Pero, de nuevo, según el trabajo de Planck, los cuanta de esas formas de luz tienen energías más altas que los de la luz visible. Por lo tanto, alterarán más la velocidad de la partícula.",
    "page": null,
    "language": "es"
   },
   {
    "id": "567870ff67ef5cda35f719d59eb8168ed8bc855b",
    "book": {
     "title": "Breves respuestas a las grandes preguntas (Spanish Edition) ",
     "author": "Hawking, Stephen",
     "highlights": [],
     "id": "174dd0fcd9843657228957fec51311eab60e9401"
    },
    "text": "En mecánica cuántica, las partículas no tienen posiciones y velocidades bien definidas. En lugar de eso, están representadas por lo que se llama la función de onda, que es un número en cada punto del espacio. El valor de la función de onda da la probabilidad de que la partícula se encuentre en dicha posición. El ritmo con que la función de onda varía de un punto a otro da la velocidad de la partícula. Se puede tener una función de onda con valor muy grande en una región muy pequeña. Eso significa que la incertidumbre en la posición es pequeña. Pero la función de onda variará muy rápidamente cerca del pico, arriba en un lado y abajo en el otro. Por lo tanto, la incertidumbre en la velocidad será grande.",
    "page": null,
    "language": "es"
   },
   {
    "id": "4d870b68ea3f3256f4ac1f1fe49a3912bfabb504",
    "book": {
     "title": "Breves respuestas a las grandes preguntas (Spanish Edition) ",
     "author": "Hawking, Stephen",
     "highlights": [],
     "id": "174dd0fcd9843657228957fec51311eab60e9401"
    },
    "text": "Otra posibilidad es que fuéramos capaces de crear microagujeros negros en las dimensiones extra del espacio-tiempo. Según algunas teorías, el universo que experimentamos es solo una superficie de cuatro dimensiones en un espacio de diez u once dimensiones. La película",
    "page": null,
    "language": "es"
   },
   {
    "id": "9fe20fa6ad4bc3ff276cbb95209876d7c1bec2d4",
    "book": {
     "title": "Breves respuestas a las grandes preguntas (Spanish Edition) ",
     "author": "Hawking, Stephen",
     "highlights": [],
     "id": "174dd0fcd9843657228957fec51311eab60e9401"
    },
    "text": "Hemos hecho a nuestro planeta el regalo desastroso del cambio climático: temperaturas crecientes, reducción de los casquetes polares, deforestación, sobrepoblación, enfermedades, guerras, hambrunas, falta de agua y diezmamiento de especies animales. Todos estos problemas tienen soluciones, pero hasta ahora no han sido aplicadas.",
    "page": null,
    "language": "es"
   },
   {
    "id": "36b1d26f4563acf441fee1ea54dd0361d9202ba1",
    "book": {
     "title": "Breves respuestas a las grandes preguntas (Spanish Edition) ",
     "author": "Hawking, Stephen",
     "highlights": [],
     "id": "174dd0fcd9843657228957fec51311eab60e9401"
    },
    "text": "El peligro es que el calentamiento global puede empezar a retroalimentarse, si no lo ha hecho ya. El derretimiento del Ártico y del casquete polar antártico reduce la fracción de energía solar que se refleja en el espacio, con lo cual la temperatura aumenta más. El cambio climático puede matar la Amazonia y otras selvas tropicales y eliminar una de las principales formas en que se extrae dióxido de carbono de la atmósfera. El aumento de la temperatura del mar puede desencadenar la liberación de grandes cantidades de dióxido de carbono, atrapado como hidruros en el fondo del océano. Ambos fenómenos pueden aumentar el efecto invernadero y el calentamiento global y podrían hacer que nuestro clima se convierta en el de Venus: hirviente y con lluvias de ácido sulfúrico, pero con una temperatura de 250 grados Celsius. La vida humana sería insostenible. Necesitamos ir más allá del Protocolo de Kioto y reducir las emisiones de carbono ahora mismo. Tenemos la tecnología para hacerlo. Solo necesitamos la voluntad política.",
    "page": null,
    "language": "es"
   }
  ],
  "id": "174dd0fcd9843657228957fec51311eab60e9401"
 },
 {
  "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
  "author": "Sandi Metz",
  "highlights": [
   {
    "id": "c72ff8722d8147836b74c6b8d99026baeca7ab53",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Bad software impedes our purpose and interferes with our happiness. Where once we felt productive, now we feel thwarted. Where once fast, now slow. Where once peaceful, now frustrated.",
    "page": null,
    "language": "en"
   },
   {
    "id": "4b7243e73e967a488ac28bfb8c5d541dc525b98c",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "When the cost of doing work exceeds its value, our efforts feel wasted.",
    "page": null,
    "language": "en"
   },
   {
    "id": "a65e948d5b25999ebb2cd67ca3a0df854c7731e7",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "The problem with poorly designed small applications is that if they are successful, they grow up to be poorly designed big applications.",
    "page": null,
    "language": "en"
   },
   {
    "id": "e3a478d8d4d2655e45276121944ed93106fddcfb",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "The purpose of design is to allow you to do design later, and its primary goal is to reduce the cost of change.",
    "page": null,
    "language": "en"
   },
   {
    "id": "e8bd4f29523e1e3bbd5b2eb01cef8f04b6fdbc9d",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "object-oriented software fails when the act of design is separated from the act of programming.",
    "page": null,
    "language": "en"
   },
   {
    "id": "a7b7f790853ea705a21852082007dd1af927f52c",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "If lack of a feature will force you out of business today, it doesn’t matter how much it will cost to deal with the code tomorrow; you must do the best you can in the time you have. Making this kind of design compromise is like borrowing time from the future and is known as taking on technical debt. This is a loan that will eventually need to be repaid, quite likely with interest.",
    "page": null,
    "language": "en"
   },
   {
    "id": "e1868b3965e5c3403be4bb43e9eea2c4faacdbc0",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "When everything in a class is related to its central purpose, the class is said to be highly cohesive or to have a single responsibility.",
    "page": null,
    "language": "en"
   },
   {
    "id": "d0e6d1f472f3bad6263fc29221b89cc88114d6b0",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "you should hide data from yourself. Doing so protects the code from being affected by unexpected changes. Data very often has behavior that you don’t yet know about.",
    "page": null,
    "language": "en"
   },
   {
    "id": "438e5de5df9a5ac0f4274cb8cd5d56ebaf2b374b",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Direct references into complicated structures are confusing, because they obscure what the data really is, and they are a maintenance nightmare, because every reference will need to be changed when the structure of the array changes.",
    "page": null,
    "language": "en"
   },
   {
    "id": "8e44ba392817352aac84b7d665fe2b570ee2c7ef",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "You do not have to know where you’re going to use good design practices to get there. Good practices reveal design.",
    "page": null,
    "language": "en"
   },
   {
    "id": "5fc8233b6188e37323930582eca9777c7a12a717",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "unjustified attachment to type. It is not the class of the object that’s important, it’s the message you plan to send to it.",
    "page": null,
    "language": "en"
   },
   {
    "id": "da53fb6bcaefbdab751de53edc47189cd9fd5cd1",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "When working on an existing application, you may find yourself under severe constraints about how much you can actually change. If prevented from achieving perfection, your goals should switch to improving the overall situation by leaving the code better than you found it.",
    "page": null,
    "language": "en"
   },
   {
    "id": "deba0bfae509859ce43dc59a713d1a05128d37c8",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "The classes in your application should depend on code that you own; use a wrapping method to isolate external dependencies.",
    "page": null,
    "language": "en"
   },
   {
    "id": "bf8cd25485438037ebff9de0b6964e659bc21c80",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Using a module here lets you define a separate and distinct object to which you can send the gear message (line 22) while simultaneously conveying the idea that you don’t expect to have instances of GearWrapper.",
    "page": null,
    "language": "en"
   },
   {
    "id": "b5c9092a3dc4dc6dd721b74cb236f805962ff800",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "replacing positional arguments with keywords is perfect for cases where you are forced to depend on external interfaces that you cannot change. Do not allow these kinds of external dependencies to permeate your code; protect yourself by wrapping each in a method that is owned by your own application.",
    "page": null,
    "language": "en"
   },
   {
    "id": "8bd4b2d0ee05f071e766edfe7a2a4b4647c492e8",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Depending on an abstraction is always safer than depending on a concretion because by its very nature, the abstraction is more stable.",
    "page": null,
    "language": "en"
   },
   {
    "id": "e746c19c005732b49b39568030f7b5c03fea1af5",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "A class that, if changed, will cause changes to ripple through the application will be under enormous pressure to never change. Ever. Under any circumstances whatsoever. Your application may be permanently handicapped by your reluctance to pay the price required to make a change to this class.",
    "page": null,
    "language": "en"
   },
   {
    "id": "dcaf84bfa387180d8a01d658649fbffc1f4924b4",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Design, therefore, must be concerned with the messages that pass between objects. It deals not only with what objects know (their responsibilities) and who they know (their dependencies) but also with how they talk to one another.  The conversation between objects takes place using their interfaces;",
    "page": null,
    "language": "en"
   },
   {
    "id": "4dea953fe381c40e9cabacb461d93f723164d991",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "public methods should read like a description of responsibilities.  The public interface is a contract that articulates the responsibilities of your class.",
    "page": null,
    "language": "en"
   },
   {
    "id": "93dab96f3537dad546b6f8d54f89f50ab24709da",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "The design goal, as always, is to retain maximum future flexibility while writing only enough code to meet today’s requirements. Good public interfaces reduce the cost of unanticipated change; bad public interfaces raise it.",
    "page": null,
    "language": "en"
   },
   {
    "id": "aaa6039e09c5361bd4e0d38267e175cd0b3eb4ae",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "having a small public interface means that there are few methods for others to depend on.",
    "page": null,
    "language": "en"
   },
   {
    "id": "5b262381e806949b7f0a369050d2741e7c02420a",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Objects that have a simple context are easy to use and easy to test; they expect few things from their surroundings. Objects that have a complicated context are hard to use and hard to test; they require complicated setup before they can do anything.",
    "page": null,
    "language": "en"
   },
   {
    "id": "aa07aa88051c55df6f58b6472c2925795b259bda",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "The clarity of your interfaces reveals your design skills and reflects your self-discipline.",
    "page": null,
    "language": "en"
   },
   {
    "id": "b54f6cb001f01f6372c3361fcde92609254a0b91",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Think about interfaces. Create them intentionally. It is your interfaces, more than all of your tests and any of your code, that define your application and determine its future.",
    "page": null,
    "language": "en"
   },
   {
    "id": "9f2030bbb98bb555cae04cfb09bdff52968e3525",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Your goal is to write code that works today, that can easily be reused, and that can be adapted for unexpected use in the future. Other people will invoke your methods; it is your obligation to communicate which ones are dependable.",
    "page": null,
    "language": "en"
   },
   {
    "id": "7958b6804a2f62988cdc44442fe613b813e24020",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Methods in the public  interface should: Be explicitly identified as such. Be more about what than how. Have names that, insofar as you can anticipate, will not change. Prefer keyword arguments.",
    "page": null,
    "language": "en"
   },
   {
    "id": "2e927b33021d273db782b3c65c974d25e6efd9fb",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Do your best to interact with other classes using only their public interfaces. Assume that the authors of those classes were just as intentional as you are now, and they are trying desperately, across time and space, to communicate which methods are dependable.",
    "page": null,
    "language": "en"
   },
   {
    "id": "704b09b0808e81f7509c190d68726b1b2e76a55b",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "you may find that you must depend on a private interface. This is a dangerous dependency that should be isolated",
    "page": null,
    "language": "en"
   },
   {
    "id": "f9c763250ed0636b74a3e13b74098cff0e87d372",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "create public methods that allow senders to get what they want without knowing how your class implements its behavior.",
    "page": null,
    "language": "en"
   },
   {
    "id": "09f1ad41540f5df3cf80f4efe32d6a7447a28687",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Even if the original author did not define a public interface, it is not too late to create one for yourself.",
    "page": null,
    "language": "en"
   },
   {
    "id": "6427129fcfdda73a2681c7ee46bdf7a2a1f592f0",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Demeter restricts the set of objects to which a method may send messages; it prohibits routing a message to a third object via a second object of a different type.",
    "page": null,
    "language": "en"
   },
   {
    "id": "2aed12ae3afa26b72f2b1c5bd1b8206eedf2515e",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Even experienced designers argue about how firmly Demeter applies to message chains that return attributes. It may be cheapest, in your specific case, to reach through intermediate objects to retrieve distant attributes. Balance the likelihood and cost of change against the cost of removing the violation.",
    "page": null,
    "language": "en"
   },
   {
    "id": "3de0f0fffd3ff64250f64f4931b4411cf76e4696",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Because the risk incurred by Demeter violations is low for stable attributes, this may be the most cost-efficient strategy. This tradeoff is permitted as long as you are not changing the value of the attribute you retrieve.",
    "page": null,
    "language": "en"
   },
   {
    "id": "24c5f0e6611df441cc306d8d11203f81f88ee1a0",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "One common way to remove train wrecks from code is to use delegation to avoid the dots. In object-oriented terms, to delegate a message is to pass it on to another object, often via a wrapper method. The wrapper method encapsulates, or hides, knowledge that would otherwise be embodied in the message chain.",
    "page": null,
    "language": "en"
   },
   {
    "id": "3999ce29d093fdde4888fa480093dbe390fcd8ee",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Using  delegation to hide tight coupling is not the same as decoupling the code.",
    "page": null,
    "language": "en"
   },
   {
    "id": "c8d64083139f03a57859ef05954d40838f21873e",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "The train wrecks of Demeter violations are clues that there are objects whose public interfaces are lacking. Listening to Demeter means paying attention to your point of view. If you shift to a message-based perspective, the messages you find will become public interfaces in the objects they lead you to discover. However, if you are bound by the shackles of existing domain objects, you’ll end up assembling their existing public interfaces into long message chains and thus will miss the opportunity to find and construct flexible public interfaces.",
    "page": null,
    "language": "en"
   },
   {
    "id": "8c4af411a86549440ddc9269de0c9aac9848810e",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Small, trustworthy self-contained objects with minimal context, clear interfaces, and injected dependencies are inherently reusable.",
    "page": null,
    "language": "en"
   },
   {
    "id": "e89bb2f947572a0cbf8583300cb0cffc4a172fad",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Inheritance is, at its core, a mechanism for automatic message delegation. It defines a forwarding path for not-understood messages. It creates relationships such that, if one object cannot respond to a received message, it delegates that message to another. You don’t have to write code to explicitly delegate the message; instead you define an inheritance relationship between two objects, and the forwarding happens automatically.",
    "page": null,
    "language": "en"
   },
   {
    "id": "fe39523c726f2cfbda116daff03e159e64fbe20b",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "this push-everything-down-and-then-pull-some-things-up strategy is an important part of this refactoring. Many of the difficulties of inheritance are caused by a failure to rigorously separate the concrete from the abstract.",
    "page": null,
    "language": "en"
   },
   {
    "id": "1614e905ad1c18d1fd7762c13abe7421ff91972d",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "When deciding between refactoring strategies, indeed, when deciding between design strategies in general, it’s useful to ask the question, “What will happen if I’m wrong?”",
    "page": null,
    "language": "en"
   },
   {
    "id": "b4d2376d567862e55028541ef0b5752135121789",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Every decision you make includes two costs: one to implement it and another to change it when you discover that you were wrong. Taking both costs into account when choosing among alternatives motivates you to make conservative choices that minimize the cost of change.",
    "page": null,
    "language": "en"
   },
   {
    "id": "b22bb9ba161161581cf3212fde0167d1a7ec0d36",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "defining a basic structure in the superclass and sending messages to acquire subclass-specific contributions is known as the template method pattern.",
    "page": null,
    "language": "en"
   },
   {
    "id": "a95bd9899e682d4a3fc2fced004f931964efb719",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Any class that uses the template method pattern must supply an implementation for every message it sends,",
    "page": null,
    "language": "en"
   },
   {
    "id": "0d1159a00abec0cf6ca3d3c60e21b8103d8434dc",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Creating code that fails with reasonable error messages takes minor effort in the present but provides value forever. Each error message is a small thing, but small things accumulate to produce big effects, and it is this attention to detail that marks you as a serious programmer. Always document template method requirements by implementing matching methods that raise useful errors.",
    "page": null,
    "language": "en"
   },
   {
    "id": "c898e7524e7d62f2377c5cf4e78ef8f12a9a36b5",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "When a subclass sends super, it’s effectively declaring that it knows the algorithm; it depends on this knowledge. If the algorithm changes, then the subclasses may break even if their own specializations are not otherwise affected.",
    "page": null,
    "language": "en"
   },
   {
    "id": "a07ab41d42e1f4152c0901e873adb11db3197b82",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Instead of allowing subclasses to know the algorithm and requiring that they send super, superclasses can instead send hook messages, ones that exist solely to provide subclasses a place to contribute information by implementing matching methods. This strategy removes knowledge of the algorithm from the subclass and returns control to the superclass.",
    "page": null,
    "language": "en"
   },
   {
    "id": "410a2fc5dc669b765473a0269a67c58819a206b5",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "when a sending object checks the class of a receiving object to determine what message to send, you have overlooked a duck type.",
    "page": null,
    "language": "en"
   },
   {
    "id": "bbc215d971bc7f911640a86704526b809468b704",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "All of the code in an abstract superclass should apply to every class that inherits it. Superclasses should not contain code that applies to some, but not all, subclasses. This restriction also applies to modules: The code in a module must apply to all who use it.",
    "page": null,
    "language": "en"
   },
   {
    "id": "b442872c2768d98c84546e3d5f88ec9c08b124b9",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Avoid writing code that requires its inheritors to send super; instead use hook messages to allow subclasses to participate while absolving them of responsibility for knowing the abstract algorithm.",
    "page": null,
    "language": "en"
   },
   {
    "id": "5045e84ed58fe8a09c652fda1eea2287a620a43c",
    "book": {
     "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2/e ",
     "author": "Sandi Metz",
     "highlights": [],
     "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
    },
    "text": "Aggregation is exactly like composition except that the contained object has an independent life. Universities have departments, which in turn have professors. If your application manages many universities and knows about thousands of professors, it’s quite reasonable to expect that although a department completely disappears when its university goes defunct, its professors continue to exist.",
    "page": null,
    "language": "en"
   }
  ],
  "id": "df5c49350f9118d33c1c67869e904e467c0deeca"
 },
 {
  "title": "Vue.js in Action ",
  "author": "Erik Hanchett, Ben Listwon",
  "highlights": [
   {
    "id": "aa6dac38498451eb4afe625f3892c3ae782f1318",
    "book": {
     "title": "Vue.js in Action ",
     "author": "Erik Hanchett, Ben Listwon",
     "highlights": [],
     "id": "152fec087c2dec32aa46206f9acb36d054a94312"
    },
    "text": "At the heart of every Vue application, no matter how big or small, is the root Vue instance, Vue instance for short.",
    "page": null,
    "language": "en"
   },
   {
    "id": "cd1df1bd7e6215fecebdf7ba5233c1c5d6946de2",
    "book": {
     "title": "Vue.js in Action ",
     "author": "Erik Hanchett, Ben Listwon",
     "highlights": [],
     "id": "152fec087c2dec32aa46206f9acb36d054a94312"
    },
    "text": "The Vue constructor accepts a single JavaScript object, known as the options object,",
    "page": null,
    "language": "en"
   },
   {
    "id": "62f16493e89ffc11ade4b10fb90dff69dbcf8fe7",
    "book": {
     "title": "Vue.js in Action ",
     "author": "Erik Hanchett, Ben Listwon",
     "highlights": [],
     "id": "152fec087c2dec32aa46206f9acb36d054a94312"
    },
    "text": "If the CSS selector we provide resolves to more than one DOM element, Vue will mount the application to the first element that matches the selector.",
    "page": null,
    "language": "en"
   },
   {
    "id": "f6065391760b40c0e2d84fea4a47b46d473dbf9f",
    "book": {
     "title": "Vue.js in Action ",
     "author": "Erik Hanchett, Ben Listwon",
     "highlights": [],
     "id": "152fec087c2dec32aa46206f9acb36d054a94312"
    },
    "text": "[Vue warn]: Property or method \"propertyname\" is not defined . . . lets you know something wasn’t defined in the options object when the instance was created.",
    "page": null,
    "language": "en"
   },
   {
    "id": "9675cd5632b7bd5a4ff2c0b6fe4e9aeff56dd3ca",
    "book": {
     "title": "Vue.js in Action ",
     "author": "Erik Hanchett, Ben Listwon",
     "highlights": [],
     "id": "152fec087c2dec32aa46206f9acb36d054a94312"
    },
    "text": "computed property It might help to think",
    "page": null,
    "language": "en"
   },
   {
    "id": "737cd5d4d84aa3d70d92db5ea87a9689aa8eb0fd",
    "book": {
     "title": "Vue.js in Action ",
     "author": "Erik Hanchett, Ben Listwon",
     "highlights": [],
     "id": "152fec087c2dec32aa46206f9acb36d054a94312"
    },
    "text": "think of the properties in the data object as representing data we’d store in a database and computed properties as dynamic values that are used primarily within the context of our view.",
    "page": null,
    "language": "en"
   },
   {
    "id": "3539ed29e8229ca4ba7293c494b331f6eda4827e",
    "book": {
     "title": "Vue.js in Action ",
     "author": "Erik Hanchett, Ben Listwon",
     "highlights": [],
     "id": "152fec087c2dec32aa46206f9acb36d054a94312"
    },
    "text": "The v-once directive renders an element or component once only. On any additional re-renders, the element or component will be treated as static content and skipped.",
    "page": null,
    "language": "en"
   }
  ],
  "id": "152fec087c2dec32aa46206f9acb36d054a94312"
 },
 {
  "title": "Monolith to Microservices ",
  "author": "Sam Newman",
  "highlights": [
   {
    "id": "f94ca204f593b62226806b62db0f3962e3257623",
    "book": {
     "title": "Monolith to Microservices ",
     "author": "Sam Newman",
     "highlights": [],
     "id": "62b69470e533fed1df790b0c3b3ac47e26c2e838"
    },
    "text": "They key is to ensure you’re only rewriting small pieces of functionality at a time, and shipping this reworked functionality to our customers regularly.",
    "page": null,
    "language": "en"
   },
   {
    "id": "f2375bd98d9eebfa57633909452fe72dac1509bf",
    "book": {
     "title": "Monolith to Microservices ",
     "author": "Sam Newman",
     "highlights": [],
     "id": "62b69470e533fed1df790b0c3b3ac47e26c2e838"
    },
    "text": "The idea is that the old and the new can co-exist, giving the new system time to grow and potentially entirely replace the old system.",
    "page": null,
    "language": "en"
   },
   {
    "id": "d25a7f74530a36d0465c2c2805dfadf1b4c6e94a",
    "book": {
     "title": "Monolith to Microservices ",
     "author": "Sam Newman",
     "highlights": [],
     "id": "62b69470e533fed1df790b0c3b3ac47e26c2e838"
    },
    "text": "we strive to not only take incremental steps towards our new application architecture, but we will also ensure that each step is easily reversible, reducing the risk of each incremental step.",
    "page": null,
    "language": "en"
   }
  ],
  "id": "62b69470e533fed1df790b0c3b3ac47e26c2e838"
 },
 {
  "title": "The Burning White: Book Five of Lightbringer ",
  "author": "Weeks, Brent",
  "highlights": [
   {
    "id": "22fa6536d168dea39d65a975308a4347a582b542",
    "book": {
     "title": "The Burning White: Book Five of Lightbringer ",
     "author": "Weeks, Brent",
     "highlights": [],
     "id": "0fe3ddb43d3483ae1ead3a0c4549e3631aff4ede"
    },
    "text": "People call others ‘gifted’ when they don’t want to believe they’re worse at something because they’re not willing to put in the work excellence requires.",
    "page": null,
    "language": "en"
   },
   {
    "id": "0e9e414b915b4cc4839752f436f458d6c6af3457",
    "book": {
     "title": "The Burning White: Book Five of Lightbringer ",
     "author": "Weeks, Brent",
     "highlights": [],
     "id": "0fe3ddb43d3483ae1ead3a0c4549e3631aff4ede"
    },
    "text": "“Strength is a choice. Courage is a habit. Unfortunately, cowardice is, too.”",
    "page": null,
    "language": "en"
   },
   {
    "id": "65a08b835327a41fdfb9a4de4d25267a629cf9b7",
    "book": {
     "title": "The Burning White: Book Five of Lightbringer ",
     "author": "Weeks, Brent",
     "highlights": [],
     "id": "0fe3ddb43d3483ae1ead3a0c4549e3631aff4ede"
    },
    "text": "with the same kind of sea demon bone that made the tygre",
    "page": null,
    "language": "en"
   },
   {
    "id": "a1e00fd53e9b901a55162ebc220d9d31db2803d3",
    "book": {
     "title": "The Burning White: Book Five of Lightbringer ",
     "author": "Weeks, Brent",
     "highlights": [],
     "id": "0fe3ddb43d3483ae1ead3a0c4549e3631aff4ede"
    },
    "text": "We see others not as they are but as we see. We see ourselves not as we are but as we see—and as we are seen, for we each cast our light on each other, too. Surrounded by those who cast only brutal light, we see some truth, and sometimes necessary truth, but a lie if we think it all the truth.",
    "page": null,
    "language": "en"
   }
  ],
  "id": "0fe3ddb43d3483ae1ead3a0c4549e3631aff4ede"
 },
 {
  "title": "The Rage of Dragons: The Burning, Book One ",
  "author": "Winter, Evan",
  "highlights": [
   {
    "id": "5d3a9bedadea8a28b42b59945ee76710a1ec3db1",
    "book": {
     "title": "The Rage of Dragons: The Burning, Book One ",
     "author": "Winter, Evan",
     "highlights": [],
     "id": "2b080f0393c89c55a431d412eb0aed40f9246599"
    },
    "text": "Life is nothing more than moments in time. To achieve greatness, you have to give up those moments. You have to give your life to your goal.”",
    "page": null,
    "language": "en"
   },
   {
    "id": "31665b8c18aa1ee180d7b517a26f0978a7ff31f0",
    "book": {
     "title": "The Rage of Dragons: The Burning, Book One ",
     "author": "Winter, Evan",
     "highlights": [],
     "id": "2b080f0393c89c55a431d412eb0aed40f9246599"
    },
    "text": "Improvement can only come through intentioned effort. Every day must be hard for you. The days without difficulty are the days you do not improve. The days you do not improve are the days the men behind you close the distance. It’s then you give your enemies hope. Hope that, when they meet you in battle, they have done enough to finish you.”",
    "page": null,
    "language": "en"
   }
  ],
  "id": "2b080f0393c89c55a431d412eb0aed40f9246599"
 },
 {
  "title": "La muerte del comendador (Libro 1) (Volumen independiente) (Spanish Edition) ",
  "author": "Murakami, Haruki",
  "highlights": [
   {
    "id": "bf1d7b4d7131d94688a8a8ec823fee505c658da4",
    "book": {
     "title": "La muerte del comendador (Libro 1) (Volumen independiente) (Spanish Edition) ",
     "author": "Murakami, Haruki",
     "highlights": [],
     "id": "b3f3cb7fe64dc779ad608911a5d7afca3ee77147"
    },
    "text": "De lejos, la mayor parte de las cosas se ven bonitas.",
    "page": null,
    "language": "es"
   }
  ],
  "id": "b3f3cb7fe64dc779ad608911a5d7afca3ee77147"
 },
 {
  "title": "La muerte del comendador (Libro 2) (Volumen independiente) (Spanish Edition) ",
  "author": "Murakami, Haruki",
  "highlights": [
   {
    "id": "f15bb2e0da2fd272b19eddb4af6fa619ffc75552",
    "book": {
     "title": "La muerte del comendador (Libro 2) (Volumen independiente) (Spanish Edition) ",
     "author": "Murakami, Haruki",
     "highlights": [],
     "id": "c68b3666396028ed72c36e8965a75b02049071aa"
    },
    "text": "No me gustan los cedés. Brillan demasiado. Están bien para ahuyentar a los cuervos colgados del alero de un tejado, pero no para escuchar música.",
    "page": null,
    "language": "es"
   },
   {
    "id": "7fbf492165becbe6322f54ce51e197b131dd1cfd",
    "book": {
     "title": "La muerte del comendador (Libro 2) (Volumen independiente) (Spanish Edition) ",
     "author": "Murakami, Haruki",
     "highlights": [],
     "id": "c68b3666396028ed72c36e8965a75b02049071aa"
    },
    "text": "no me acostumbraba a ver a la gente hacer fotos con los teléfonos móviles. Menos aún, al hecho de que llamasen por teléfono con una cámara de fotos.",
    "page": null,
    "language": "es"
   }
  ],
  "id": "c68b3666396028ed72c36e8965a75b02049071aa"
 },
 {
  "title": "Padre rico. Padre pobre (Nueva edición actualizada). (Spanish Edition) ",
  "author": "Kiyosaki, Robert T.",
  "highlights": [
   {
    "id": "af6a6fdab9cf7fde5eaee6fc3896cad3efb84c4c",
    "book": {
     "title": "Padre rico. Padre pobre (Nueva edición actualizada). (Spanish Edition) ",
     "author": "Kiyosaki, Robert T.",
     "highlights": [],
     "id": "5205d8a8cdf4445c4ef3f6e1b79149c3f47ca454"
    },
    "text": "Sólo memorizamos fechas y nombres, pero nunca aprendemos la lección.",
    "page": null,
    "language": "es"
   }
  ],
  "id": "5205d8a8cdf4445c4ef3f6e1b79149c3f47ca454"
 },
 {
  "title": "El Pozo de la Ascensión (Nacidos de la bruma [Mistborn] 2) (Spanish Edition) ",
  "author": "Sanderson, Brandon",
  "highlights": [
   {
    "id": "6cafa5acbe9f3d3a4eaf3873a4731c18b9cbbf15",
    "book": {
     "title": "El Pozo de la Ascensión (Nacidos de la bruma [Mistborn] 2) (Spanish Edition) ",
     "author": "Sanderson, Brandon",
     "highlights": [],
     "id": "f7291c8327d7c67cecfda53a962274f5414d3236"
    },
    "text": "A primera vista, la llave y la cerradura en la que encaja pueden parecer muy distintas —dijo Sazed—. Diferentes en su forma, diferentes en su función, diferentes en su diseño. El hombre que las mira sin conocer su verdadera naturaleza puede pensar que son opuestas, pues una sirve para abrir y la otra para mantener cerrado. Sin embargo, examinándolas con atención, se ve que sin una la otra no sirve para nada. El hombre sabio ve que la cerradura y la llave fueron creadas para el mismo propósito.",
    "page": null,
    "language": "es"
   }
  ],
  "id": "f7291c8327d7c67cecfda53a962274f5414d3236"
 },
 {
  "title": "El Héroe de las Eras (Nacidos de la bruma [Mistborn] 3) (Spanish Edition) ",
  "author": "Sanderson, Brandon",
  "highlights": [
   {
    "id": "45e068e6dc4e34f33b728fab5acc12103d74805a",
    "book": {
     "title": "El Héroe de las Eras (Nacidos de la bruma [Mistborn] 3) (Spanish Edition) ",
     "author": "Sanderson, Brandon",
     "highlights": [],
     "id": "6cf5fa8a2d9568b4d0b0b9ba3974dad3c4fb9137"
    },
    "text": "naturaleza del mundo es tal que, cuando creamos algo, a menudo destruimos otra cosa en el proceso.",
    "page": null,
    "language": "es"
   },
   {
    "id": "5b099500abfcddec7b632c0391459fb85b56ce76",
    "book": {
     "title": "El Héroe de las Eras (Nacidos de la bruma [Mistborn] 3) (Spanish Edition) ",
     "author": "Sanderson, Brandon",
     "highlights": [],
     "id": "6cf5fa8a2d9568b4d0b0b9ba3974dad3c4fb9137"
    },
    "text": "Un hombre es aquello por lo que siente pasión. He descubierto que, si renuncias a lo que más quieres por lo que piensas que deberías querer más, acabarás sintiéndote inútil.",
    "page": null,
    "language": "es"
   },
   {
    "id": "0c12c6ea8c90729262b406c324831da222a7354e",
    "book": {
     "title": "El Héroe de las Eras (Nacidos de la bruma [Mistborn] 3) (Spanish Edition) ",
     "author": "Sanderson, Brandon",
     "highlights": [],
     "id": "6cf5fa8a2d9568b4d0b0b9ba3974dad3c4fb9137"
    },
    "text": "No obstante, demasiado de cualquier cosa es letal. El agua es necesaria para la supervivencia, pero demasiada ahoga.",
    "page": null,
    "language": "es"
   }
  ],
  "id": "6cf5fa8a2d9568b4d0b0b9ba3974dad3c4fb9137"
 },
 {
  "title": "It Doesn’t Have to Be Crazy at Work ",
  "author": "Fried, Jason",
  "highlights": [
   {
    "id": "3f667c444602eb16bae52b11ef43b52a2d7c1a73",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "Sustained exhaustion is not a badge of honor, it’s a mark of stupidity.",
    "page": null,
    "language": "en"
   },
   {
    "id": "5b433b134ca71df97331b5598375007432e30bbf",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "But when you think of the company as a product, you ask different questions: Do people who work here know how to use the company? Is it simple? Complex? Is it obvious how it works? What’s fast about it? What’s slow about it? Are there bugs? What’s broken that we can fix quickly and what’s going to take a long time?",
    "page": null,
    "language": "en"
   },
   {
    "id": "face8dff6c4da582ead3f92e0cdfb3335029571a",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "A company is like software. It has to be usable, it has to be useful.",
    "page": null,
    "language": "en"
   },
   {
    "id": "84dd7ac861841e7980471b391ca4f46e1b7eb8f7",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "Running a calm company is, unfortunately, not the default way to run a company these days. You have to work against your instincts for a while. You have to put toxic industry norms aside. You have to recognize that “It’s crazy at work” isn’t right.",
    "page": null,
    "language": "en"
   },
   {
    "id": "a3e5f086bb0eb5f694b2d3f97f97981deb039654",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "You can dare to be completely ordinary every now and then.",
    "page": null,
    "language": "en"
   },
   {
    "id": "4d027f7f66a55e0b79eadbae1fb1d9725a71569c",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "“Comparison is the death of joy.”",
    "page": null,
    "language": "en"
   },
   {
    "id": "1143a76b558f372c0087d16678372f6c4d3b03be",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "Goals are fake. Nearly all of them are artificial targets set for the sake of setting targets.",
    "page": null,
    "language": "en"
   },
   {
    "id": "2f0bd6b77fec8f02d2d5eb237ba210a84667b8cf",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "worry less (or not at all!) about changing the world. Chances are, you won’t, and if you do, it’s not going to be because you said you would.",
    "page": null,
    "language": "en"
   },
   {
    "id": "1926114b53cf9f34f75b73af98696b5ef54d27ec",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "If you can’t fit everything you want to do within 40 hours per week, you need to get better at picking what to do, not work longer hours.",
    "page": null,
    "language": "en"
   },
   {
    "id": "c436b8d99d4588b45d75c8f677758a5b7e1fb092",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "A great work ethic isn’t about working whenever you’re called upon. It’s about doing what you say you’re going to do, putting in a fair day’s work, respecting the work, respecting the customer, respecting coworkers, not wasting time, not creating unnecessary work for other people, and not being a bottleneck.",
    "page": null,
    "language": "en"
   },
   {
    "id": "6cf12e88f063acdab78a5cc18d69a220cc4306dd",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "Ask people where they go when they really need to get something done. One answer you’ll rarely hear: the office.",
    "page": null,
    "language": "en"
   },
   {
    "id": "62ed43237e56664859683e95d386db7ee997bbf9",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "“But how do you know if someone’s working if you can’t see them?” Same answer as this question: “How do you know if someone’s working if you can see them?” You don’t. The only way to know if work is getting done is by looking at the actual work.",
    "page": null,
    "language": "en"
   },
   {
    "id": "eacde0fb3405c633346ffc6a20badaa97ee6e6c5",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "the further away you are from the fruit, the lower it looks. Once you get up close, you see it’s quite a bit higher than you thought.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "a43ab7039cdd511dae8a5c0cffc31a3d58bc1ded",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "All chat all the time conditions you to believe everything’s worth discussing quickly right now, except that hardly anything is. Almost everything can and should wait until someone has had a chance to think it through and properly write it up.",
    "page": null,
    "language": "en"
   },
   {
    "id": "c2576d981f28256f9aa02d8adbeca605705db673",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "It’s when you try to fix both scope and time that you have a recipe for dread, overwork, and exhaustion.",
    "page": null,
    "language": "en"
   },
   {
    "id": "1c6cc45131e12539ce5892e68b85d227b3d898a0",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "Normal comes on quick. First it starts as an outlier. Some behavior you don’t love, but tolerate. Then someone else follows suit, but either you miss it or you let it slide. Then people pile on—repeating what they’ve seen because no one stepped in to course correct. Then it’s too late. It’s become the culture. The new normal.",
    "page": null,
    "language": "en"
   },
   {
    "id": "b3015d9ef18aa5fccf7ffe078c77a2b898ad7ddb",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "Culture is what culture does. Culture isn’t what you intend it to be. It’s not what you hope or aspire for it to be. It’s what you do. So do better.",
    "page": null,
    "language": "unknown"
   },
   {
    "id": "41ce51af65427f63232c585fef11246162bda583",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "big-bang releases bundle the risk from every component, so if one thing falls behind, the whole thing can get held up. Which it always does.",
    "page": null,
    "language": "en"
   },
   {
    "id": "cdba43cd68444c08122508e33e8adf24c0e6cd5b",
    "book": {
     "title": "It Doesn’t Have to Be Crazy at Work ",
     "author": "Fried, Jason",
     "highlights": [],
     "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
    },
    "text": "Jeff Bezos put it well in his 2017 letter to shareholders: I disagree and commit all the time. We recently greenlit a particular Amazon Studios original. I told the team my view: debatable whether it would be interesting enough, complicated to produce, the business terms aren’t that good, and we have lots of other opportunities. They had a completely different opinion and wanted to go ahead. I wrote back right away with “I disagree and commit and hope it becomes the most watched thing we’ve ever made.” Consider how much slower this decision cycle would have been if the team had actually had to convince me rather than simply get my commitment.",
    "page": null,
    "language": "en"
   }
  ],
  "id": "3fc458b31e258cdd9726f0aeede5f8817064d97a"
 }
]